{
  "id": "dec16-jan7-2025",
  "title": "December 16, 2025 - January 7, 2026",
  "date": "January 7, 2026",
  "dateRange": "December 16, 2025 - January 7, 2026",
  "summary": "WAN 2.6 launches with 15-second consistency and multi-shot control, Seedance 1.5 Pro and Flux 2 Max released, Apple enters AI with image-to-Gaussian Splatting, Kling adds voice control and motion control features, Meta acquires Manus AI agent, Genvid releases The Seeker film and studio production tool, Billy Boman delivers P&G commercial adaptation with Media Monks, comprehensive upscaling and consistency techniques shared, 1 Billion Summit AI Film Award finalists announced, and RealDreams HQ welcomes Stephan Bugaj, Sultan, and Andy McNamara.",
  "stats": {
    "tools": 14,
    "tutorials": 33,
    "insights": 12,
    "links": 48
  },
  "keyHighlights": [
    "WAN 2.6 launches with 15-second consistency and multi-shot motion control",
    "Apple enters AI space with image-to-Gaussian Splatting technology",
    "Meta acquires Manus AI agent platform for $2 billion",
    "Genvid releases The Seeker GenAI film and studio production tool",
    "Billy Boman delivers P&G commercial adaptation using AI workflow with Media Monks",
    "1 Billion Summit AI Film Award finalists announced with public voting"
  ],
  "topPosters": [
    {
      "name": "David Clark",
      "count": 139
    },
    {
      "name": "Aaron Bhugobaun",
      "count": 85
    },
    {
      "name": "Billy Boman",
      "count": 78
    }
  ],
  "sections": [
    {
      "title": "🚀 Major Updates & News",
      "items": [
        {
          "title": "🎬 WAN 2.6 Released with Multi-Shot Control",
          "link": "https://wan-video.com",
          "overview": "<strong>Ludovic</strong> announces WAN 2.6 with 15-second consistency, perfect audio sync, one-prompt multi-shot control, and character/voice replication.",
          "description": "<strong>Ludovic</strong> announced WAN 2.6 on Wan-Video, highlighting major improvements: 15-second consistency with perfect audio sync, one-prompt multi-shot control, ability to replicate character ID and voice from 2-10 second clips with audio upload support, multi-character and cartoon support, and commercial-grade output quality. <strong>Ludovic</strong> demonstrated the capabilities with a first test showing multi-shot text-to-video generation in a single 15-second prompt, showcasing the system's ability to maintain consistency across multiple shots without manual editing. The single-gen dialogue prompt featured over-the-shoulder alternating perspectives with emotionally charged cinematic drama.",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🎥 Seedance 1.5 Pro Released",
          "link": "",
          "overview": "<strong>Edmond Yang</strong> and <strong>Ludovic</strong> test the new Seedance 1.5 Pro model with impressive text-to-video results.",
          "description": "<strong>Edmond Yang</strong> asked about Seedance 1.5 Pro release, and <strong>Ludovic</strong> quickly tested it, sharing impressive single-gen text-to-video results. The test demonstrated the model's capability for cinematic dialogue scenes with proper audio sync and emotional depth.",
          "posters": [
            "Edmond Yang",
            "Ludovic"
          ]
        },
        {
          "title": "🖼️ Flux 2 Max Released",
          "link": "https://bfl.ai/models/flux-2-max",
          "overview": "<strong>Luka T</strong> announces Flux 2 Max release, noting no open weights expected.",
          "description": "<strong>Luka T</strong> announced that Flux 2 Max is out, noting that open weights are not yet available and probably never will be. The release came on a day when multiple AI models dropped simultaneously, with <strong>Winston Mayo</strong> joking about everyone thinking it was safe to release on the same day.",
          "posters": [
            "Luka T",
            "Winston Mayo"
          ]
        },
        {
          "title": "🎤 Kling Voice Control Feature",
          "link": "https://app.klingai.com/global/release-notes/7trhudk78j?type=dialog",
          "overview": "<strong>Ludovic</strong> shares Kling 2.6 voice control release notes for natural language video prompting.",
          "description": "<strong>Ludovic</strong> shared the release notes for Voice Control in Kling 2.6, enabling natural language video prompting capabilities. The community discussed the feature's potential for more intuitive video generation workflows.",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🍎 Apple Image-to-Gaussian Splatting",
          "link": "https://www.linkedin.com/posts/martin-nebelong_from-2-second-faster-on-higher-end-gpus-activity-7407403800929390592-Rc8U",
          "overview": "<strong>Rory Flynn</strong> and <strong>Martin Nebelong</strong> discuss Apple's entry into AI with image-to-Gaussian Splatting technology.",
          "description": "<strong>Rory Flynn</strong> shared news about Apple developing AI capabilities, noting he didn't even know Apple was in the space. <strong>Martin Nebelong</strong> demonstrated the technology, generating Gaussian Splat scenes from single images in just 2 seconds on a 4090 GPU. <strong>Justin Hackney</strong> called it \"actually huge\" that Apple has entered the chat. <strong>Martin Nebelong</strong> showed integration with Octane Render 2026, creating impressive results. <strong>ChristianF.</strong> mentioned the Marble WorldLabs integration into Octane Render 2026 for similar capabilities.",
          "posters": [
            "Rory Flynn",
            "Martin Nebelong",
            "Justin Hackney",
            "ChristianF."
          ]
        },
        {
          "title": "🤖 Meta Acquires Manus AI Agent",
          "link": "https://manus.im/blog/manus-joins-meta-for-next-era-of-innovation",
          "overview": "<strong>Kēkā</strong> and <strong>Stephan Bugaj</strong> discuss Meta's $2 billion acquisition of Manus AI agent platform.",
          "description": "<strong>Kēkā</strong> shared the news that Meta acquired Manus, expressing concern as Manus had been a daily agent tool in his work for almost a year. <strong>Stephan Bugaj</strong> noted that when Meta bought Play.ai, they stopped supporting customers entirely. <strong>Kēkā</strong> provided extensive analysis, noting Manus is still strides ahead of Google Studio as a 1-stop research-to-deployable widget builder. The acquisition was valued at $2 billion for approximately 100 people at a 3-year-old company. <strong>Rourke</strong> mentioned Meta also recently acquired Limitless, an AI wearable device. <strong>Matthieu</strong> suggested Antigravity as an alternative, though <strong>Kēkā</strong> noted Manus is better for non-dev users and multi-tool workflows.",
          "posters": [
            "Kēkā",
            "Stephan Bugaj",
            "Rourke",
            "Matthieu",
            "Aaron Bhugobaun"
          ]
        },
        {
          "title": "🎬 Genvid Releases The Seeker Film & Studio Tool",
          "link": "https://gamesbeat.com/genvid-releases-sci-fi-genai-film-the-seeker/",
          "overview": "<strong>Stephan Bugaj</strong> announces the release of The Seeker GenAI film and Genvid studio production platform.",
          "description": "<strong>Stephan Bugaj</strong>, Emmy Award winning CCO of Genvid Entertainment and Pixar veteran, announced the release of \"The Seeker,\" a 22-minute GenAI sci-fi film, along with the Genvid GenAI Studio Workflow Tool he designed. The tool supports many image and video models and allows users to bring their own API keys from Kling, Google, Minimax, LTX, Higgsfield, etc. <strong>Stephan Bugaj</strong> offered Google Meet walkthroughs for productions interested in the tool. Animation Magazine featured the release, highlighting his Innovation Emmy win and Pixar background.",
          "posters": [
            "Stephan Bugaj"
          ]
        },
        {
          "title": "🏆 1 Billion Summit AI Film Award Finalists",
          "link": "https://www.1billionsummit.com/ai-film-award",
          "overview": "<strong>Winston Mayo</strong>, <strong>Billy Boman</strong>, and <strong>Mark Wachholz</strong> discuss the AI Film Award finalists and voting process.",
          "description": "<strong>Winston Mayo</strong> announced that the list and voting for the million dollar AI film is open. <strong>Mark Wachholz</strong> was congratulated for being shortlisted. The community discussed the estimated 20,000+ submissions based on the mid-November press release. <strong>Billy Boman</strong> shared the finalists link, noting he hadn't heard of any of the creators and found the work lacking artistic flair. <strong>Mark Wachholz</strong> created a YouTube playlist attempting to collect all submissions, finding only 39 of the estimated 3,500-30,000+ entries. <strong>PJ Accetturo</strong> noted only about 2 good films in the top 10.",
          "posters": [
            "Winston Mayo",
            "Billy Boman",
            "Mark Wachholz",
            "PJ Accetturo",
            "Chris First"
          ]
        },
        {
          "title": "🎮 Kling Motion Control Feature",
          "link": "https://x.com/Kling_ai/status/2001306445262823431",
          "overview": "<strong>Sultan</strong>, <strong>Ryan Phillips</strong>, and <strong>Tobi</strong> discuss Kling's new motion control capabilities.",
          "description": "<strong>Sultan</strong> asked if anyone had played with the new Kling motion control feature. <strong>Edmond Yang</strong> and <strong>Ryan Phillips</strong> confirmed they had tested it, with <strong>Ryan Phillips</strong> calling it \"very good.\" <strong>Tobi</strong> posted tests on LinkedIn, noting it's great for semi-realistic content but often fails at more stylized characters like 3D. For hyper-realistic characters, there's still some uncanniness, though the level of micro-expressions is amazing.",
          "posters": [
            "Sultan",
            "Ryan Phillips",
            "Edmond Yang",
            "Tobi"
          ]
        },
        {
          "title": "📺 Secret Level Academy Launches",
          "link": "https://tvnewscheck.com/ai/article/secret-level-introduces-secret-level-academy-training-hollywood-for-the-ai-driven-production-era/",
          "overview": "<strong>Minh</strong> shares news of Secret Level Academy training Hollywood for AI-driven production.",
          "description": "<strong>Minh</strong> shared the announcement of Secret Level Academy, a new initiative training Hollywood for the AI-driven production era. The program aims to prepare industry professionals for the integration of AI tools into traditional production workflows.",
          "posters": [
            "Minh"
          ]
        },
        {
          "title": "🎨 Reve V11 and V11 Fast Released",
          "link": "https://www.linkedin.com/posts/reveimage_reve-v11-and-reve-v11-fast-are-here-we-activity-7407493843501318145-dT1o",
          "overview": "<strong>Jordan Daniel Chesney</strong> shares Reve V11 model release announcement.",
          "description": "<strong>Jordan Daniel Chesney</strong> shared the release of Reve V11 and Reve V11 Fast models. He later mentioned being excited to receive Reve merch, noting he begged them for it and will \"wear it too much.\" <strong>Billy Boman</strong> expressed interest in getting merch as well.",
          "posters": [
            "Jordan Daniel Chesney",
            "Billy Boman"
          ]
        },
        {
          "title": "🔺 Trellis 2 for 3D Generation",
          "link": "https://fal.ai/models/fal-ai/trellis-2",
          "overview": "<strong>Edmond Yang</strong> recommends Trellis 2 on fal.ai for 3D model generation.",
          "description": "<strong>Edmond Yang</strong> shared that he's been using Trellis 2 on fal.ai for 3D generation, calling it \"pretty good.\" <strong>Martin LeBlanc</strong> asked about the best workflow for image-to-3D model generation, and <strong>BasvdE</strong> recommended Vizcom.com for products and tripo3d.ai for characters. <strong>Martin LeBlanc</strong> tested Tripo3D and got good results even for complex models, noting the ability to move models to any angle and use NBP for final renders gives great control and consistency.",
          "posters": [
            "Edmond Yang",
            "Martin LeBlanc",
            "BasvdE"
          ]
        },
        {
          "title": "🎵 Open Source Music Model Released",
          "link": "https://x.com/cocktailpeanut/status/2005673873757413760",
          "overview": "<strong>Rory Flynn</strong> shares news of an open source music generation model.",
          "description": "<strong>Rory Flynn</strong> shared news of an open source music generation model. <strong>Winston Mayo</strong> asked if it's as good as Suno, sparking discussion about the state of AI music generation tools.",
          "posters": [
            "Rory Flynn",
            "Winston Mayo"
          ]
        },
        {
          "title": "🖼️ Qwen-Image-Edit-2511 with ComfyUI Support",
          "link": "https://x.com/i/status/2003496348461728213",
          "overview": "<strong>Ramon Guthrie</strong> announces Qwen-Image-Edit-2511 release with Day-1 ComfyUI support.",
          "description": "<strong>Ramon Guthrie</strong> announced Qwen-Image-Edit-2511 with Day-1 ComfyUI support and lightning Loras for lower hardware, calling it \"how you release a model!\" The release demonstrated best practices for model deployment with immediate community tool integration.",
          "posters": [
            "Ramon Guthrie"
          ]
        }
      ]
    },
    {
      "title": "📚 Tutorials & Techniques",
      "items": [
        {
          "title": "🎬 Wan 2.6: One‑Prompt Multi‑Shot + Character & Voice ID",
          "overview": "<strong>Ludovic</strong> summarizes the core Wan 2.6 capabilities that enable longer, more coherent shots and identity/voice continuity.",
          "description": "**What’s new / why it matters:** *Wan 2.6 was called out for ~15s consistency with strong audio sync, plus “one‑prompt multi‑shot control” (planning multiple shots inside one generation). It also supports multi‑character/cartoon outputs and aims at commercial-grade results.* **Identity + voice workflow (high level):** *Use short reference material (2–10s clips were mentioned) to replicate character ID + voice. If supported in your interface, provide the audio via an “Upload Audio” / reference-audio input, then prompt the scene beats clearly so the model has a stable plan to follow.* **Prompting tip:** *Write prompts like a shot list (Shot 1 / Shot 2 / Shot 3), with consistent wardrobe/location details repeated each time to reduce drift across the multi-shot sequence.*",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🧪 Wan 2.6: Where to Try + Credit Budgeting",
          "overview": "Quick operational notes from the group on where Wan 2.6 was available and how to estimate costs.",
          "description": "**Where people tested it:** *Wan 2.6 was mentioned as accessible via Krea and Higgsfield. A direct trial option was also referenced at `https://wan.video`.* **Credit math (as reported in chat):** *“150 free credits” were noted for trying Wan, and a “15 sec shot is 45 credits” estimate was shared. Use that ratio to plan iterations (e.g., reserve extra budget for retries if you’re doing multi-shot prompts).*",
          "posters": [
            "Luka T",
            "Ludovic"
          ]
        },
        {
          "title": "🗣️ Seedance 1.5: Script‑Style Prompting for Clean Dialogue Scenes",
          "overview": "A prompt pattern highlighted by <strong>Ludovic</strong> for generating cinematic dialogue (single-gen) without subtitles.",
          "description": "**Technique:** *Prompt like a screenplay + shot description: define the setting, the camera language (framing, movement), the emotional tone, and then include dialogue lines explicitly (who says what).* **Quality controls:** *Specify “no subtitles” and include audio intent (tone, pacing, pauses). If your tool supports it, lean on native audio generation to keep dialogue and performance aligned.*",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🎙️ Kling 2.6: Voice Control (Release Notes)",
          "overview": "<strong>Ludovic</strong> flags the arrival of Voice Control in Kling 2.6 and points to the official release notes.",
          "description": "**How to use this in practice:** *When you need spoken lines to land, treat voice control as a first-class constraint: keep dialogue short, specify who speaks when, and avoid overstuffing a single shot with too many conversational beats.* **Reference:** *Release notes link shared in chat: `https://app.klingai.com/global/release-notes/7trhudk78j?type=dialog`*",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🎭 Wan VACE / ComfyUI: “Real Masking” for Performance‑Accurate Edits",
          "overview": "A recurring point in the chat: Wan VACE-style workflows were valued for masking and performance preservation.",
          "description": "**Why Wan here:** *Members noted they “haven’t seen a non‑Wan workflow that allows actual masking,” and called out the ability to keep a performance accurate (useful for character replacement / targeted edits without collateral changes).* **Where to test:** *RunComfy + ComfyUI were mentioned as places people test Wan VACE (more “nerdy,” but higher control).* **When to choose this over a simpler app:** *If you must isolate a subject (face/wardrobe/object) and keep everything else stable, prioritize a masking-first pipeline (Wan/Comfy) over “prompt-and-pray” consumer flows.*",
          "posters": [
            "Albert Bozesan",
            "Martin LeBlanc",
            "David Clark",
            "Ryan Phillips"
          ]
        },
        {
          "title": "🌍 Commercial Localization Sprint: Rewriting a TVC for a New Market",
          "overview": "Billy shares a tight-turnaround workflow used for a P&G proof-of-concept featuring a new local celebrity.",
          "description": "**The challenge:** *Replace key talent and update scenes (including tricky 2‑shots) fast, while keeping the commercial feeling consistent.* **Workflow highlights:** *Use Wan for the hardest shots (notably 2‑shots with big height/pose differences). Work iteratively on those “risk shots” first, then propagate the look to easier singles.* **Audio workaround:** *Billy noted isolating original TVC sound/music from the original-language dialogue so the spot could be reworked for English delivery.* **Scope call:** *Lip sync was explicitly called out as “out of scope” given the turnaround time—plan for that early (either accept imperfect lip sync, rewrite angles, or budget more time).*",
          "posters": [
            "Billy Boman"
          ]
        },
        {
          "title": "🖼️ No Outpainting? Switch Aspect Ratios via Nano First‑Frame Reference",
          "overview": "A workaround for when a video tool can’t outpaint to a new format.",
          "description": "**Problem:** *You want to change formats (e.g., 16:9 → 9:16), but the video model/tool doesn’t support outpainting.* **Workaround:** *Extract the first frame, outpaint/resize it in Nano (or another still editor), then feed that edited frame back into your video model as the image reference for regenerating the shot in the new aspect ratio.* **Why it works:** *The edited first frame anchors composition and framing, so the regenerated clip “starts correct” in the target format.*",
          "posters": [
            "Matthiei",
            "Rory Flynn"
          ]
        },
        {
          "title": "⏱️ Freepik “Extend” Workflow: Break Duration Limits by Extending with Veo 2",
          "overview": "Jordan shares a practical method to extend short clips and even hop models without visible seams.",
          "description": "**Use case:** *You’re capped at short durations (e.g., ~8 seconds) and need more time without obvious cuts.* **Workflow:** **Step 1: Base clip** *Generate your first clip in Freepik with whichever model you want (Jordan specifically noted you can start in one model, like Kling).* **Step 2: Extend** *Use Freepik’s Extend feature (noted as using Veo 2) to lengthen the clip.* **Step 3: Check seams** *Jordan reported moving from Kling → Veo 2 extend “without noticeable jumps or quality changes,” which makes this workflow powerful for longer sequences.*",
          "posters": [
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🧱 Seadream on FAL: Better Physics for 1080p Short Clips",
          "overview": "Jordan calls out Seadream as a strong option when physics realism matters.",
          "description": "**What it’s good for:** *Physics-heavy shots (body mechanics, object interactions) where other models can look “AI-wobbly.”* **Practical note:** *Seadream was mentioned as available on FAL with ~12 second clips in 1080p (as shared in chat).*",
          "posters": [
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "📐 Perspective Locking Trick: Vanishing Points → Nano Reference Overlay",
          "overview": "Rory shares a perspective-control experiment to keep scenes geometrically consistent.",
          "description": "**Technique:** *Extract a frame with the exact perspective you want. In Pluribus, identify the vanishing point and draw the convergence lines. Then apply those lines to a new image and use that as a reference with Nano.* **Why it’s useful:** *Perspective drift is a common failure mode in image generation. A vanishing-point overlay gives the model a strong geometric “hint” about where lines should converge.*",
          "posters": [
            "Rory Flynn"
          ]
        },
        {
          "title": "🧪 Practical Refraction Hack: Glass Tubes + Water + Mirror",
          "overview": "Edmond shares a low-tech, high-impact practical effects trick for believable refraction/distortion.",
          "description": "**Setup:** *Place glass tubes filled with water in front of the camera, and add a mirror behind (to amplify/refine the look).* **Why you’d do this:** *If you can capture real refraction in-camera, your AI enhancement/editing step has cleaner “truth” to build from than a fully synthetic refraction effect.*",
          "posters": [
            "Martin LeBlanc",
            "Edmond Yang"
          ]
        },
        {
          "title": "🎞️ Smoothing Harsh Motion: 2× Upscale + Subtle Digital Zoom",
          "overview": "<strong>Alex</strong> shares a simple post trick to reduce perceived harshness/jitter in motion.",
          "description": "**Technique:** *Keep a 2× upscaled version of your clip. If motion feels too harsh, smooth it with a very subtle digital zoom in/out during the edit.* **Why it works:** *A tiny zoom reframes the viewer’s attention and can hide micro-jitters, especially after upscaling.*",
          "posters": [
            "Alex"
          ]
        },
        {
          "title": "📱 Fast “iPhone UGC” Realism: Soul + Magnific Skin Enhance",
          "overview": "Jordan shares a speed workflow for raw, believable UGC texture.",
          "description": "**Stack:** *Generate in Soul for “realism / iPhone look,” then run Magnific’s skin enhance to polish texture quickly.* **When it shines:** *Creator/UGC ads where “too perfect” looks fake. This combo was positioned as a fast path to believable skin and phone-camera realism.*",
          "posters": [
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🧩 Nano Banana Reference Images: Separate vs Combined + Moodboard Grid Pattern",
          "overview": "A practical reference-assembly pattern for Nano Banana projects that need multiple assets.",
          "description": "**What works best (as shared):** *Separate reference images tend to produce cleaner adherence than packing everything into one composite image.* **Reference packaging pattern:** *Use a moodboard as a grid for broad vibe/style, and keep critical assets as singular items.* **Extra tip:** *A “single” reference image can still contain multiple views of the same item (e.g., different angles) inside one file.*",
          "posters": [
            "Jovardi",
            "Yonatan",
            "Rory Flynn"
          ]
        },
        {
          "title": "🧷 Grid Splitting Utility: Extract Individual Images from a Grid",
          "overview": "<strong>BasvdE</strong> asks for a grid extractor; <strong>Yonatan</strong> notes DorLabs has a solution.",
          "description": "**Use case:** *You have a 3×3 (or similar) image grid and need the individual images back as separate files.* **Tool note (as shared):** *DorLabs was mentioned as having a grid extractor, with an EU rollout planned “next week” (at the time of the chat).*",
          "posters": [
            "BasvdE",
            "Yonatan"
          ]
        },
        {
          "title": "🧱 Image → 3D Model Toolkit: Vizcom, Tripo3D, Hunyuan 3D",
          "overview": "<strong>BasvdE</strong> shares a fast shortlist of image-to-3D options depending on what you’re modeling.",
          "description": "**Recommendations:** *Vizcom for products (depending on source image).* *Tripo3D for character-style models.* *Hunyuan 3D-2.1 was mentioned as producing “studio-quality” 3D from flat images (generalist option).* **Practical advice:** *Choose the tool based on the subject (product vs character), then plan for cleanup/rigging if you need animation.*",
          "posters": [
            "Martin LeBlanc",
            "BasvdE"
          ]
        },
        {
          "title": "🎛️ Pose Control Workflow: 3D Model → Pose → Nano Final “Render”",
          "overview": "Martin shares a control-first approach: use 3D to lock geometry, then Nano to lock style.",
          "description": "**Workflow:** **Step 1: Generate a 3D model** *Use a tool like Tripo3D (or similar) to generate the base model.* **Step 2: Pose / rotate** *Move the model to any angle you want (pose control in 3D is the win here).* **Step 3: Style unify** *Feed the posed render into Nano Banana Pro to create the final “render,” improving consistency and creative control.*",
          "posters": [
            "Martin LeBlanc"
          ]
        },
        {
          "title": "🦴 Rigging Prep Tip: Separate Limbs + Start from T‑Pose",
          "overview": "A quick modeling/rigging note from the 3D discussion.",
          "description": "**Best practice:** *Make sure limbs are separated if you plan to rig the model.* **Pose setup:** *T‑pose was suggested as the right starting point when the goal is to rig and then animate.*",
          "posters": [
            "Martin LeBlanc",
            "Rory Flynn"
          ]
        },
        {
          "title": "🧰 fal.ai Trellis‑2: Quick 3D Generation Alternative",
          "overview": "Edmond shares an alternate image→3D option used in practice.",
          "description": "**Tool:** *Trellis‑2 on FAL was described as “pretty good” for generating 3D models: `https://fal.ai/models/fal-ai/trellis-2`* **When to use:** *If your current image→3D tool is too slow (Hunyuan v3 was mentioned as “good, but takes forever”), try Trellis‑2 for faster iteration.*",
          "posters": [
            "Edmond Yang",
            "Rory Flynn",
            "Martin LeBlanc"
          ]
        },
        {
          "title": "🧠 Train FLUX.2 LoRAs: Rent GPUs on RunPod + Ostris",
          "overview": "<strong>Alex</strong> mentions a straightforward approach for training custom FLUX LoRAs without owning hardware.",
          "description": "**Workflow (high level):** *Rent GPUs on RunPod, and use Ostris to train FLUX.2 LoRAs.* **Why it’s useful:** *Lets you spin up training capacity only when needed—good for sprint work and experimentation.*",
          "posters": [
            "Alex"
          ]
        },
        {
          "title": "🔍 Visual Forensics Prompts: Weavy Flow for Frame Analysis",
          "overview": "Rory shares a “visual forensics” prompt setup hosted in Weavy.",
          "description": "**What it’s for:** *Drop in a still frame and run structured prompts for analysis/inspection (Rory described it as more useful for token extraction than anything else).* **Link shared:** `https://app.weavy.ai/flow/NJ3TenYhPduuBv6ohGHrN3?ref=rory72`",
          "posters": [
            "Rory Flynn"
          ]
        },
        {
          "title": "🕹️ Interactive Prototype Workflow: Gemini Canvas + MediaPipe Hand Controls",
          "overview": "Ozan demonstrates how quickly interactive experiences can be prototyped now.",
          "description": "**What he built:** *Recreated Duck Hunt using Gemini Canvas + MediaPipe, using the webcam for controls.* **Gesture mapping:** *Open hand to aim; fist to shoot.* **Why it matters:** *Shows a fast path from concept → playable prototype without a full engineering team.*",
          "posters": [
            "Ozan Sihay"
          ]
        },
        {
          "title": "🟩 SpriteSwap‑Studio: Photo → Playable Game Boy ROM",
          "overview": "Lovis shares an open-source tool that turns a photo into a playable retro ROM.",
          "description": "**What it does:** *Turns a photo into a playable Game Boy ROM using AI.* **Repo shared:** `https://github.com/lovisdotio/SpriteSwap-Studio`",
          "posters": [
            "Lovis Odin"
          ]
        },
        {
          "title": "🧬 Hybrid AI Compositing Pipeline: Generate Elements Separately, Then Composite",
          "overview": "Billy shares a behind-the-scenes principle for high-control hybrid shots.",
          "description": "**Core principle:** *Generate each major element as a separate AI video to maximize control (rather than forcing everything into one “all-in-one” generation).* **Example from the gig:** *Use Wan to fix/standardize a specific element (e.g., making a soccer player wear the same uniform as the rest while matching lighting), then composite into the final scene.* **Why it works:** *Element separation makes it easier to iterate and match continuity (lighting, costume, motion) shot-by-shot.*",
          "posters": [
            "Billy Boman"
          ]
        },
        {
          "title": "💸 Sponsorship Ops: Don’t Post Before You’re Paid",
          "overview": "A recurring operational warning: brands sometimes delay or avoid payment after content goes live.",
          "description": "**Best practice:** *Request payment (or at least a clear milestone payment) prior to posting. If payment isn’t secured, don’t publish (“no collab”).* **Why:** *Creators shared frustration with payment delays once a sponsored video is already live.*",
          "posters": [
            "Robert O’Shaugnessy",
            "Andreas Massouras"
          ]
        },
        {
          "title": "🎯 Virality Heuristic: “Food, Sex, Danger” (Ideally in One Shot)",
          "overview": "PJ shares a simple creative filter for designing viral concepts.",
          "description": "**Rule of thumb:** *Viral moments tend to contain: Food, Sex, and Danger.* **Execution note:** *Best if it’s “all baked in one shot” (a single moment that communicates the hook instantly).*",
          "posters": [
            "PJ Accetturo"
          ]
        },
        {
          "title": "💼 LinkedIn Premium for Creators: Likely Not Worth It",
          "overview": "Several creators compare notes on whether LinkedIn Premium helps.",
          "description": "**Consensus from the chat:** *Not necessary for most individual creators; some reported reduced reach after going Premium.* **When it *can* matter:** *More relevant for companies, recruiters, and teams using Sales Navigator / hiring features.*",
          "posters": [
            "Alex",
            "Billy Boman",
            "Rory Flynn",
            "Kat Gellein Viken",
            "Chad Nelson"
          ]
        },
        {
          "title": "🔐 Security Hygiene: Suspicious Email Waves → Reset Passwords",
          "overview": "A quick safety reminder triggered by members receiving unusual emails.",
          "description": "**What to do:** *If you get a sudden wave of suspicious emails (e.g., unexpected podcast/PR outreach), treat it as a potential compromise: reset passwords and review account security.*",
          "posters": [
            "Blvckl!ght"
          ]
        },
        {
          "title": "🧾 Credit/Pricing UX Caution: Always Compare “Credits per $”",
          "overview": "<strong>Yonatan</strong> flags a “pricing trick” experience and recommends checking the math.",
          "description": "**Tip:** *Don’t assume the default/“recommended” plan is best. Compare the effective credits-per-dollar across options, and confirm you’re not paying more for fewer credits via UI nudges.* **Good habit:** *Screenshot your checkout and keep receipts so you can reconcile later if something feels off.*",
          "posters": [
            "Yonatan"
          ]
        },
        {
          "title": "🧽 Quick Quality Boost: Upscale in Magnific When Needed",
          "overview": "A simple finishing step中王 noted as part of several creators’ workflows.",
          "description": "**Use case:** *If your output is almost there but needs crispness or polish, run an upscale pass (Magnific was explicitly mentioned) before final grading/editing.*",
          "posters": [
            "David Clark"
          ]
        },
        {
          "title": "🧠 AI Disclosure Strategy: Reduce Backlash by Avoiding “Misleading Realism”",
          "overview": "<strong>Blvckl!ght</strong> shares a practical framing approach: how you position AI work affects audience reaction.",
          "description": "**Rule of thumb:** *If the piece is clearly “impossible” (obviously AI, surreal, or hyper-stylized), disclosure tends to matter less. If it looks like real people/events, audiences are more likely to feel misled—so set expectations up front.* **Creative angle:** *Lean into the “impossible-ness” of AI as a feature (not a bug) to keep the work in a clearly synthetic lane.*",
          "posters": [
            "Blvckl!ght"
          ]
        },
        {
          "title": "📛 Copyright/Claim Recovery: Plan for Reuploads + Escalation",
          "overview": "<strong>Sultan</strong> notes having to reupload after a rights claim and flags vendor support as part of the process.",
          "description": "**What happened:** *A trailer needed a reupload after a rights-owner claim; Higgsfield was reportedly investigating the strike source.* **Best practice:** *Keep project files and exports organized so reuploads are fast. If a platform/tool is involved, escalate with them early (provide links, timestamps, and proof of original creation).*",
          "posters": [
            "Sultan"
          ]
        },
        {
          "title": "🧮 Production Reality Check: “Cheap + Fast + Excellent” Still Doesn’t Exist",
          "overview": "A candid timeline/cost discussion on what’s realistic for AI narrative production.",
          "description": "**Key point:** *If someone promises “Pixar quality” for extremely low budgets, assume they’re not billing their own time (or they’re underestimating iteration + post).* **Iteration management:** *To move faster, you need strong multidisciplinary skills *and* creative compromises aimed at reducing iterations (fewer shot types, fewer character changes, simpler staging).* **Data point shared:** *Stephan mentioned completing a ~20min film in ~6 weeks with a sound editor; without that help, it would have taken longer.*",
          "posters": [
            "Stephan Bugaj",
            "winston mayo"
          ]
        }
      ]
    },
    {
      "title": "🎨 Community Showcases & Projects",
      "items": [
        {
          "title": "🎬 Billy Boman - Storytytel Campfire AI Film",
          "link": "https://www.linkedin.com/posts/billyboman_%F0%9D%97%A6%F0%9D%98%81%F0%9D%97%BC%F0%9D%97%BF%F0%9D%98%86%F0%9D%98%81%F0%9D%97%B2%F0%9D%97%B9-%F0%9D%97%96%F0%9D%97%AE%F0%9D%97%BA%F0%9D%97%BD%F0%9D%97%B3%F0%9D%97%B6%F0%9D%97%BF%F0%9D%97%B2-%F0%9D%97%94%F0%9D%97%9C-%F0%9D%97%99-activity-7407770304313450496-2w_p",
          "overview": "<strong>Billy Boman</strong> shares Storytytel Campfire AI Film project with distributed team.",
          "description": "<strong>Billy Boman</strong> shared the Storytytel Campfire AI Film, describing it as a labor of love and one of the first projects with a wider distributed team as they scale to a boutique studio offering. <strong>Jordan Daniel Chesney</strong> called it \"unbelievably cool\" and praised how <strong>Billy Boman</strong> \"wrestled the clients wishes to the ground and gently choked them out into a gentle slumber of high-quality storytelling.\"",
          "posters": [
            "Billy Boman",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎄 Blvckl!ght - 70s Claymation Holiday Video",
          "link": "https://x.com/blvcklightai/status/2003299872435585378",
          "overview": "<strong>Blvckl!ght</strong> creates a 70s claymation-style Christmas animation.",
          "description": "<strong>Blvckl!ght</strong> shared a 70s claymation holiday video, with <strong>Chris First</strong> praising the \"immaculate vibes\" that remind him of childhood Christmas animations, calling it \"so normal, like it's a Christmas classic.\" <strong>Blvckl!ght</strong> also received a shoutout from Fairground for his work with them throughout 2025.",
          "posters": [
            "Blvckl!ght",
            "Chris First"
          ]
        },
        {
          "title": "🎬 Alex - Christmas Short Film",
          "link": "https://www.linkedin.com/feed/update/urn:li:activity:7409256998900297729/",
          "overview": "<strong>Alex</strong> shares an ambitious Christmas short film with warm daylight aesthetics.",
          "description": "<strong>Alex</strong> shared his most ambitious short to date, with <strong>Jordan Daniel Chesney</strong> praising the aesthetics and feeling of warmth in the daylight. <strong>Alex</strong> acknowledged imperfections but noted \"at one point, you gotta post.\" He also shared that one of his videos (jellyfish turning into a flower) made it into an OpenAI promotional post.",
          "posters": [
            "Alex",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🥷 Sultan - Naruto Trailer",
          "link": "https://www.instagram.com/reel/DSlQHFbjJYt/?igsh=endrcjFxZHRscTcy",
          "overview": "<strong>Sultan</strong> shares his viral Naruto trailer that faced copyright issues.",
          "description": "<strong>Sultan</strong> shared his Naruto trailer, noting he had to reupload it due to a copyright scam with fake right owners. Higgsfield is investigating who filed the strike. <strong>Sultan</strong>'s work has gone viral with hundreds of millions of views, including a kangaroo UFC clip.",
          "posters": [
            "Sultan"
          ]
        },
        {
          "title": "🎬 Yonatan - King of The Streets Collab",
          "link": "https://www.instagram.com/reel/DSarJ10DIlA/",
          "overview": "<strong>Yonatan</strong> shares collaboration video with King of The Streets.",
          "description": "<strong>Yonatan</strong> shared their latest video in collaboration with King of The Streets. <strong>Jordan Daniel Chesney</strong> praised it as \"next level\" with \"Gaspar Noe vibes.\"",
          "posters": [
            "Yonatan",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎬 Ari Kuschnir - 1 Billion Summit Entry",
          "link": "https://youtu.be/6J8qpqGBSww?si=e81H334N2yFUFAQM",
          "overview": "<strong>Ari Kuschnir</strong> shares his most ambitious short for the 1 Billion Summit.",
          "description": "<strong>Ari Kuschnir</strong> shared his most ambitious short to date, a story his friend David Sauvage had last summer that they decided to make for the 1 Billion Summit. He noted learning a lot and pushing as much as he could.",
          "posters": [
            "Ari Kuschnir"
          ]
        },
        {
          "title": "🎬 David Clark - 2025 Swan Song",
          "link": "https://youtu.be/s5qIfjjtjGc?si=ziugz68kk-dgGegq",
          "overview": "<strong>David Clark</strong> shares his 2025 swan song video.",
          "description": "<strong>David Clark</strong> shared his 2025 swan song video as a year-end creative piece. He was also invited by Google for a Sundance panel but will be knee deep in production.",
          "posters": [
            "David Clark"
          ]
        },
        {
          "title": "🎬 Junie - ByteDance New Year Film",
          "link": "https://www.instagram.com/reel/DS4opEwD9US/?igsh=MWYzdzkwN2h4dXB0bg==",
          "overview": "<strong>Junie</strong> creates New Year short film \"One Blink\" for ByteDance.",
          "description": "<strong>Junie</strong> shared that ByteDance invited her to create the New Year short film \"One Blink,\" a light sci-fi love story. She wished everyone a happy New Year with hopes for genuine love in the year ahead.",
          "posters": [
            "Junie"
          ]
        },
        {
          "title": "🎬 Rourke - AI 2025 Reflections",
          "link": "https://www.instagram.com/p/DS5OJ45DMRN/",
          "overview": "<strong>Rourke</strong> shares \"AI fucked up everything in 2025\" final thoughts video.",
          "description": "<strong>Rourke</strong> shared his final thoughts for 2025 with a clever loop video. <strong>Yonatan</strong> praised the clever loop technique.",
          "posters": [
            "Rourke",
            "Yonatan"
          ]
        },
        {
          "title": "🎬 PJ Accetturo - Big Trailer",
          "link": "https://x.com/PJaccetturo/status/2008559114704875888",
          "overview": "<strong>PJ Accetturo</strong> announces \"Big Trailer PJ is back\" with new trailer release.",
          "description": "<strong>PJ Accetturo</strong> announced his return with a new trailer, with <strong>Matthiei</strong> suggesting Hunter Schaffer for even more engagement.",
          "posters": [
            "PJ Accetturo",
            "Matthiei"
          ]
        },
        {
          "title": "🎨 Matthieu - Ross Lovegrove AI Chair Design",
          "link": "https://www.dezeen.com/2025/12/19/ross-lovegrove-google-deepmind-ai-chair-design/",
          "overview": "<strong>Matthieu</strong> shares collaboration with Ross Lovegrove on AI-designed chair featured in Dezeen.",
          "description": "<strong>Matthieu</strong> shared that their collaboration with Ross Lovegrove on an AI-design chair was recently featured in Dezeen. He also mentioned his video for CES aired.",
          "posters": [
            "Matthieu"
          ]
        },
        {
          "title": "🎬 Jovardi - Dubai Competition Entry",
          "link": "https://youtu.be/xiprjuEnAp8",
          "overview": "<strong>Jovardi</strong> shares 10-minute film created in 3-4 weeks for Dubai competition.",
          "description": "<strong>Jovardi</strong> shared his Dubai competition entry, noting it was done in about 3-4 weeks including sound design, original score, and grading. For client work, he would 10x everything.",
          "posters": [
            "Jovardi"
          ]
        }
      ]
    },
    {
      "title": "👋 New Members",
      "items": [
        {
          "title": "🎬 Stephan Bugaj - Pixar Veteran & Genvid CCO",
          "link": "https://www.linkedin.com/in/bugaj",
          "overview": "<strong>Justin Hackney</strong> welcomes Emmy Award winning CCO of Genvid Entertainment, formerly of Pixar, Telltale, DJ2 Entertainment, Hanson Robotics, and Bell Labs.",
          "description": "<strong>Justin Hackney</strong> introduced <strong>Stephan Bugaj</strong>, describing his ridiculous background across tech, films, animation, games, and now diving deep into AI. Stephan's 22-minute GenAI film \"The Seeker\" went public along with the Genvid GenAI Studio Workflow Tool he designed. The community warmly welcomed him with messages from <strong>Ludovic</strong>, <strong>Jordan Daniel Chesney</strong>, <strong>Aaron Bhugobaun</strong>, <strong>Henry</strong>, and many others.",
          "posters": [
            "Justin Hackney",
            "Stephan Bugaj"
          ]
        },
        {
          "title": "🎬 Sultan Unaspekov - Higgsfield Creative Partner",
          "link": "https://www.linkedin.com/in/sultan-unaspekov-751506231/",
          "overview": "<strong>Aaron Bhugobaun</strong> welcomes <strong>Sultan</strong>, viral AI creator with hundreds of millions of views.",
          "description": "<strong>Aaron Bhugobaun</strong> introduced <strong>Sultan Unaspekov</strong>, noting his journey from running around film sets as a kid to producing commercial work across Europe. After experimenting with Kling, Minimax, and ComfyUI, <strong>Sultan</strong> joined Higgsfield as a Creative Partner, creating boundary-pushing demos. His work includes a viral MrBeast spec and a kangaroo UFC clip with hundreds of millions of views.",
          "posters": [
            "Aaron Bhugobaun",
            "Sultan"
          ]
        },
        {
          "title": "🎬 Andy McNamara - Cinesite TechX Lead",
          "link": "https://www.linkedin.com/in/andymac3d",
          "overview": "<strong>Aaron Bhugobaun</strong> welcomes <strong>Andy</strong>, award-winning CG & VFX Supervisor with 35+ years experience.",
          "description": "<strong>Aaron Bhugobaun</strong> introduced <strong>Andy McNamara</strong>, an award-winning CG & VFX Supervisor, Creative Director, and Technologist with 35+ years at the sharp end of creative media. He's led CGI and VFX teams at BBC, Publicis, Prime Focus, and Cinesite. Now driving TechX, Cinesite's generative AI initiative, exploring how AI will shape the next era of filmmaking across VFX, feature animation, and immersive storytelling.",
          "posters": [
            "Aaron Bhugobaun",
            "Andy"
          ]
        }
      ]
    },
    {
      "title": "💼 Professional Opportunities",
      "items": [
        {
          "title": "📺 TV Show Crowd Shots - Runway/Nuke Required",
          "link": "",
          "overview": "<strong>Jordan Daniel Chesney</strong> announces full-time contract work for 200 crowd shots on a TV show.",
          "description": "<strong>Jordan Daniel Chesney</strong> announced a job opportunity for full-time contract work on a TV show requiring 200 crowd shots. Must be done with Runway and requires familiarity with Nuke as well as fluency with AI. Starts first week of January.",
          "posters": [
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎬 Wonder Studios Animation Project Roles",
          "link": "https://job-boards.eu.greenhouse.io/wonderstudios/jobs/4736732101",
          "overview": "<strong>Harry</strong> announces contract roles for Wonder Studios animation project.",
          "description": "<strong>Harry</strong> announced Wonder Studios is looking for contract roles for an animation project: Creative Lead (focused on execution, visual consistency, and quality control) and Production Lead (to run schedule, team coordination, and feedback cycles). Fixed-term project from January to May, hands-on roles.",
          "posters": [
            "Harry"
          ]
        },
        {
          "title": "🎪 GCSC Future Studio Event - London",
          "link": "",
          "overview": "<strong>Aaron Bhugobaun</strong> announces GCSC Future Studio event at Google Kings Cross office in February.",
          "description": "<strong>Aaron Bhugobaun</strong> announced another GCSC Future Studio event in London at Google Kings Cross office in February, with open invitation to all. He's also planning sessions and welcomes anyone who wants to participate.",
          "posters": [
            "Aaron Bhugobaun"
          ]
        },
        {
          "title": "🎬 Wonder Film Festival Winner Livestream",
          "link": "https://app.wonderstudios.com/c/events/film-festival-winner-livestream",
          "overview": "<strong>Justin Hackney</strong> announces Wonder Film Festival winner livestream and future creator conversations.",
          "description": "<strong>Justin Hackney</strong> announced plans for livestream sessions with creators, starting with the Film Festival winner. He expressed interest in going \"deep down the rabbit hole\" beyond just film/process discussions, exploring topics ranging from work to the singularity. A poll showed 18 votes for interest in livestream sessions.",
          "posters": [
            "Justin Hackney"
          ]
        },
        {
          "title": "🎯 Silicon Valley Video Summit",
          "link": "https://siliconvalley.video/sign-up/",
          "overview": "<strong>Gabe Michael</strong> shares free registration for Silicon Valley Video Summit on January 27.",
          "description": "<strong>Gabe Michael</strong> shared information about the 2026 Silicon Valley Video Summit on January 27 in SF. Free registration available to qualified applicants until January 15, then $150. Promo code \"SVVS2026\" bypasses payment after January 15.",
          "posters": [
            "Gabe Michael"
          ]
        },
        {
          "title": "🎬 CES and 1 Billion Film Summit Attendance",
          "link": "",
          "overview": "Community members coordinate attendance at CES and 1 Billion Film Summit in Dubai.",
          "description": "Multiple community members coordinated attendance at major events. <strong>Chris First</strong> asked about Dubai attendance for 1BFS, <strong>Avocado Papi</strong> confirmed being at CES until the 10th and attending the Lionsgate party, <strong>Kleverov</strong> and <strong>Stephan Bugaj</strong> confirmed CES attendance. <strong>David Clark</strong> noted his co-founder George will be on a panel at 1BFS.",
          "posters": [
            "Chris First",
            "Avocado Papi",
            "Kleverov",
            "Stephan Bugaj",
            "David Clark"
          ]
        }
      ]
    },
    {
      "title": "💬 Industry Discussions & Insights",
      "items": [
        {
          "title": "🎬 AI Film Quality and Plateau Discussion",
          "link": "",
          "overview": "Community debates whether AI creative tools have reached a plateau with photorealism achieved.",
          "description": "<strong>Rourke</strong> raised the question of whether AI creative tools have plateaued, noting \"we're literally at photo realism on all fronts.\" <strong>Rory Flynn</strong> suggested video and 3D/4D will go much heavier. <strong>Carl-Johann Simon-Gabriel</strong> noted audio and sound design still have lots of progress ahead, with innovation coming in editing capabilities and controllability. <strong>BasvdE</strong> shared predictions for 2026 including worldbuilding platforms, brand worlds, YouTube Games, home robots, and major studio AI series launches.",
          "posters": [
            "Rourke",
            "Rory Flynn",
            "Carl-Johann Simon-Gabriel",
            "BasvdE",
            "Kēkā"
          ]
        },
        {
          "title": "💰 AI Film Pricing and Timeline Realities",
          "link": "",
          "overview": "Community discusses realistic pricing and timelines for AI film production.",
          "description": "Discussion sparked by people promising 100-minute animated movies in 4 months for $5,000. <strong>Stephan Bugaj</strong> noted it's doable if you're good at all disciplines, don't charge for your own time, and make creative compromises - but excellent results are unlikely. <strong>Blvckl!ght</strong> confirmed 100 mins in 4 months is doable with experience, having done 90 mins in 30 days. <strong>Adrian Daniel Botnariu</strong> estimated 6 months for comfortable quality at $250k+. <strong>Rory Flynn</strong> noted $5k barely covers generation costs. The consensus: anyone saying \"Pixar quality for $5,000\" is clearly hallucinating.",
          "posters": [
            "Stephan Bugaj",
            "Blvckl!ght",
            "Adrian Daniel Botnariu",
            "Rory Flynn",
            "Winston Mayo",
            "Chad Nelson"
          ]
        },
        {
          "title": "⚠️ Higgsfield Controversies",
          "link": "https://www.youtube.com/watch?v=7Zj10P0Sa1k",
          "overview": "Community discusses ongoing Higgsfield controversies including pricing tricks and marketing stunts.",
          "description": "<strong>Yonatan</strong> exposed a pricing trick where he paid $79 for 4,210 credits while they advertise $89 for 6,000 credits - paying 26-27% more per credit with misleading UI language. <strong>Blair</strong> noted it \"feels like it's run by a scam call centre.\" <strong>Blvckl!ght</strong> shared a YouTube video documenting the issues. <strong>Billy Boman</strong> dubbed it \"Cringefield - the AI Scamcenter.\" Despite controversies, <strong>Jordan Daniel Chesney</strong> noted Higgi Soul is still a wonderful model for realistic UGC content.",
          "posters": [
            "Yonatan",
            "Blair",
            "Blvckl!ght",
            "Billy Boman",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎬 Cinema's Future and Viewing Habits",
          "link": "https://apple.news/AL86gsZlVQjSND8Q7iU8cEA",
          "overview": "Discussion on changing audience viewing habits and cinema's future.",
          "description": "<strong>Chad Nelson</strong> shared thoughts on cinema becoming like opera houses - respected but no longer mainstream. His nephews (ages 6-12) have zero interest in theater movies unless on phones/iPads. <strong>Aaron Bhugobaun</strong> noted audience viewing habits have changed and will keep changing, driven by likes and followers. <strong>Jovardi</strong> disagreed, distinguishing between creation (pen and paper is enough) and viewing (getting inspired by others' perspectives). Discussion touched on YouTube's potential TV-channel functions and emerging exhibition platforms.",
          "posters": [
            "Chad Nelson",
            "Aaron Bhugobaun",
            "Jovardi"
          ]
        },
        {
          "title": "🤝 Community and Competition in 2026",
          "link": "",
          "overview": "Discussion on the importance of community as AI competition intensifies.",
          "description": "<strong>Alex</strong> predicted 2026 will be fiercely competitive with giants trying to crush everyone in winner-takes-all dynamics (referencing The Black Swan by Nassim Nicholas Taleb). He emphasized sticking together, building strong networks, and supporting one another. <strong>Blvckl!ght</strong> agreed that 2025 was the year to form relationships and weed out the less serious from those with true drive, grit, and creativity.",
          "posters": [
            "Alex",
            "Blvckl!ght"
          ]
        },
        {
          "title": "⚠️ Recraft.ai Payment Warning",
          "link": "",
          "overview": "<strong>Robert O'Shaugnessy</strong> warns about Recraft.ai ghosting on sponsored video payment.",
          "description": "<strong>Robert O'Shaugnessy</strong> shared a word of caution about doing a sponsored video with Recraft.ai - they ghosted him on communications and payment after the video went live. <strong>Billy Boman</strong> thanked him for sharing and calling them out. <strong>Winston Mayo</strong> asked how to prevent companies from taking advantage of creators.",
          "posters": [
            "Robert O'Shaugnessy",
            "Billy Boman",
            "Winston Mayo"
          ]
        },
        {
          "title": "💼 LinkedIn Premium Discussion",
          "link": "",
          "overview": "Community discusses whether LinkedIn Premium is worth it for creators.",
          "description": "<strong>Alex</strong> asked if LinkedIn Premium is worth it. <strong>Billy Boman</strong> said no from his experience, gaining almost 16k subscribers organically in 2025 without premium. <strong>Rory Flynn</strong> noted less reach since going premium and more shadow bans, with LinkedIn mistaking virality for bot activity. <strong>Kat Gellein Viken</strong> agreed it killed her reach for ages. <strong>Chad Nelson</strong> noted it's more suited for recruiters and employers than individuals.",
          "posters": [
            "Alex",
            "Billy Boman",
            "Rory Flynn",
            "Kat Gellein Viken",
            "Chad Nelson"
          ]
        },
        {
          "title": "🎬 AI vs Authenticity Discussion",
          "link": "",
          "overview": "<strong>Billy Boman</strong> shares take on AI vs authenticity with premium/luxury lens.",
          "description": "<strong>Billy Boman</strong> shared what he called one of the best takes on AI vs \"Authenticity\" with a premium/luxury lens. <strong>Aaron Bhugobaun</strong> highlighted the key line: \"The real thing that is getting replaced is the act of being average.\" <strong>Chad Nelson</strong> added \"No place for lazy creative in the new world.\"",
          "posters": [
            "Billy Boman",
            "Aaron Bhugobaun",
            "Chad Nelson",
            "Adrian Daniel Botnariu"
          ]
        },
        {
          "title": "🎬 AI Film Editing Quality Discussion",
          "link": "",
          "overview": "<strong>Martin LeBlanc</strong> analyzes what's missing in 1 Billion Summit submissions.",
          "description": "<strong>Martin LeBlanc</strong> asked what's missing to elevate the 1 Billion Summit submissions. He identified proper editing as the key element missing in most films - too long cuts, many clips in slow-motion, and poorly written/unnatural dialogue. The discussion highlighted the importance of traditional filmmaking craft even with AI generation tools.",
          "posters": [
            "Martin LeBlanc",
            "PJ Accetturo",
            "Blair"
          ]
        },
        {
          "title": "🎓 AI Education Market Opportunity",
          "link": "https://www.instagram.com/reel/DTLiq85EhfH/?igsh=eGNvODUxMXBxYTFl",
          "overview": "<strong>Yonatan</strong> and community discuss the massive opportunity in AI education.",
          "description": "<strong>Billy Boman</strong> noted more joining the AI education game. <strong>Yonatan</strong> revealed they have 10,000 people on the waiting list for educational content with estimated $4M-$18M income potential, but need good tutorial producers. <strong>Billy Boman</strong> suggested <strong>Rourke</strong>, Simon Meyer, <strong>Rory Flynn</strong>, and <strong>Albert Bozesan</strong> as fantastic creators. <strong>David Clark</strong> noted Curious Refuge is thriving in 170+ countries but takes lots of effort and daily updates.",
          "posters": [
            "Yonatan",
            "Billy Boman",
            "Albert Bozesan",
            "Rourke",
            "David Clark"
          ]
        },
        {
          "title": "🎬 AI Company Acquisitions and Alternatives",
          "link": "",
          "overview": "Discussion on Meta's acquisition strategy and finding alternative tools.",
          "description": "Following Meta's acquisition of Manus, the community discussed the pattern of Meta buying AI companies and discontinuing customer support (Play.ai example). <strong>Matthieu</strong> suggested Antigravity as an alternative. <strong>Rourke</strong> noted Meta also acquired Limitless AI wearable. The discussion highlighted concerns about relying on tools that might be acquired and shut down.",
          "posters": [
            "Kēkā",
            "Stephan Bugaj",
            "Matthieu",
            "Rourke"
          ]
        },
        {
          "title": "🎬 Future of Creative Work Discussion",
          "link": "",
          "overview": "<strong>Chad Nelson</strong> discusses universal tools and exploring personal imagination.",
          "description": "<strong>Chad Nelson</strong> predicted that when universal tools/engines are available, people will explore their own imagination without need for external creators. He noted it's more fun to explore your own imagination unless you like/agree with the creator, find them truly entertaining and genuine, and feel they \"get you.\" His 8-year-old nephew said \"you cannot trust Disney or Pixar because they don't like Mr Beast, and Netflix is cooler.\" The discussion explored the generational shift in content consumption and creation.",
          "posters": [
            "Chad Nelson",
            "Aaron Bhugobaun",
            "Jovardi"
          ]
        }
      ]
    },
    {
      "title": "🔗 Links & Resources",
      "categories": [
        {
          "title": "🛠️ Tool Releases & Updates",
          "links": [
            {
              "title": "WAN 2.6 Release",
              "url": "https://wan-video.com",
              "description": "15-second consistency with multi-shot control"
            },
            {
              "title": "Flux 2 Max",
              "url": "https://bfl.ai/models/flux-2-max",
              "description": "Latest image generation model"
            },
            {
              "title": "Kling Voice Control Release Notes",
              "url": "https://app.klingai.com/global/release-notes/7trhudk78j?type=dialog",
              "description": "Natural language video prompting"
            },
            {
              "title": "Kling Motion Control",
              "url": "https://x.com/Kling_ai/status/2001306445262823431",
              "description": "New motion control capabilities"
            },
            {
              "title": "Reve V11 Release",
              "url": "https://www.linkedin.com/posts/reveimage_reve-v11-and-reve-v11-fast-are-here-we-activity-7407493843501318145-dT1o",
              "description": "V11 and V11 Fast models"
            },
            {
              "title": "Trellis 2 on fal.ai",
              "url": "https://fal.ai/models/fal-ai/trellis-2",
              "description": "3D model generation"
            },
            {
              "title": "Tripo3D",
              "url": "http://tripo3d.ai",
              "description": "Image to 3D conversion"
            },
            {
              "title": "Qwen-Image-Edit-2511",
              "url": "https://x.com/i/status/2003496348461728213",
              "description": "Day-1 ComfyUI support"
            },
            {
              "title": "SpriteSwap Studio (Open Source)",
              "url": "https://github.com/lovisdotio/SpriteSwap-Studio",
              "description": "Photo to Game Boy ROM converter"
            }
          ]
        },
        {
          "title": "📰 News & Announcements",
          "links": [
            {
              "title": "Meta Acquires Manus",
              "url": "https://manus.im/blog/manus-joins-meta-for-next-era-of-innovation",
              "description": "$2 billion AI agent acquisition"
            },
            {
              "title": "Apple Gaussian Splatting Demo",
              "url": "https://www.linkedin.com/posts/martin-nebelong_from-2-second-faster-on-higher-end-gpus-activity-7407403800929390592-Rc8U",
              "description": "Image-to-3D in 2 seconds"
            },
            {
              "title": "The Seeker Film Release",
              "url": "https://gamesbeat.com/genvid-releases-sci-fi-genai-film-the-seeker/",
              "description": "Genvid's 22-minute GenAI film"
            },
            {
              "title": "The Seeker - Animation Magazine",
              "url": "https://www.animationmagazine.net/2025/12/innovation-emmy-winner-pixar-vet-releases-ai-animated-short-the-seeker/",
              "description": "Emmy winner coverage"
            },
            {
              "title": "Secret Level Academy Launch",
              "url": "https://tvnewscheck.com/ai/article/secret-level-introduces-secret-level-academy-training-hollywood-for-the-ai-driven-production-era/",
              "description": "Hollywood AI training program"
            },
            {
              "title": "Ross Lovegrove AI Chair - Dezeen",
              "url": "https://www.dezeen.com/2025/12/19/ross-lovegrove-google-deepmind-ai-chair-design/",
              "description": "AI-designed furniture collaboration"
            },
            {
              "title": "OpenAI Promotional Post (Alex's Work)",
              "url": "https://x.com/OpenAI/status/2003594025098785145",
              "description": "Jellyfish to flower transformation"
            }
          ]
        },
        {
          "title": "🎨 Community Showcases",
          "links": [
            {
              "title": "Billy Boman - Storytytel Campfire",
              "url": "https://www.linkedin.com/posts/billyboman_%F0%9D%97%A6%F0%9D%98%81%F0%9D%97%BC%F0%9D%97%BF%F0%9D%98%86%F0%9D%98%81%F0%9D%97%B2%F0%9D%97%B9-%F0%9D%97%96%F0%9D%97%AE%F0%9D%97%BA%F0%9D%97%BD%F0%9D%97%B3%F0%9D%97%B6%F0%9D%97%BF%F0%9D%97%B2-%F0%9D%97%94%F0%9D%97%9C-%F0%9D%97%99-activity-7407770304313450496-2w_p",
              "description": "Distributed team AI film project"
            },
            {
              "title": "Billy Boman - Hybrid VFX Production",
              "url": "https://www.linkedin.com/posts/billyboman_check-out-our-latest-work-in-cooperation-activity-7414634831248048128-0GqF",
              "description": "P&G commercial with Media Monks"
            },
            {
              "title": "Blvckl!ght - Holiday Claymation",
              "url": "https://x.com/blvcklightai/status/2003299872435585378",
              "description": "70s claymation Christmas video"
            },
            {
              "title": "Alex - Christmas Short",
              "url": "https://www.linkedin.com/feed/update/urn:li:activity:7409256998900297729/",
              "description": "Ambitious short with upscale technique"
            },
            {
              "title": "Sultan - Naruto Trailer",
              "url": "https://www.instagram.com/reel/DSlQHFbjJYt/?igsh=endrcjFxZHRscTcy",
              "description": "Viral anime adaptation"
            },
            {
              "title": "Yonatan - King of The Streets",
              "url": "https://www.instagram.com/reel/DSarJ10DIlA/",
              "description": "Gaspar Noe vibes collaboration"
            },
            {
              "title": "Ari Kuschnir - 1 Billion Summit Entry",
              "url": "https://youtu.be/6J8qpqGBSww?si=e81H334N2yFUFAQM",
              "description": "Most ambitious short to date"
            },
            {
              "title": "David Clark - 2025 Swan Song",
              "url": "https://youtu.be/s5qIfjjtjGc?si=ziugz68kk-dgGegq",
              "description": "Year-end creative piece"
            },
            {
              "title": "Junie - ByteDance New Year Film",
              "url": "https://www.instagram.com/reel/DS4opEwD9US/?igsh=MWYzdzkwN2h4dXB0bg==",
              "description": "One Blink sci-fi love story"
            },
            {
              "title": "Rourke - AI 2025 Reflections",
              "url": "https://www.instagram.com/p/DS5OJ45DMRN/",
              "description": "Clever loop final thoughts"
            },
            {
              "title": "PJ Accetturo - Big Trailer",
              "url": "https://x.com/PJaccetturo/status/2008559114704875888",
              "description": "Big Trailer PJ returns"
            },
            {
              "title": "Jovardi - Dubai Competition",
              "url": "https://youtu.be/xiprjuEnAp8",
              "description": "10-minute film in 3-4 weeks"
            },
            {
              "title": "Martin LeBlanc - ProCreate to AI",
              "url": "https://x.com/martinleblanc/status/2007110933785796729",
              "description": "Sketch to animation workflow"
            }
          ]
        },
        {
          "title": "📚 Tutorials & Workflows",
          "links": [
            {
              "title": "AI VFX Breakdown",
              "url": "https://www.linkedin.com/posts/nitchhiltgen_vfx-ia-hybridcreativity-activity-7406593282958561280-usv0",
              "description": "Hybrid production techniques"
            },
            {
              "title": "Rory Flynn - Visual Forensics Workflow",
              "url": "https://app.weavy.ai/flow/NJ3TenYhPduuBv6ohGHrN3?ref=rory72",
              "description": "System prompts for frame analysis"
            },
            {
              "title": "Paul Trillo - Etherea BTS",
              "url": "https://www.linkedin.com/posts/paul-trillo-544b268_etherea-was-inspired-by-the-pareidolia-phenomenon-activity-7413979466537811968-4fXk",
              "description": "Behind the scenes workflow"
            },
            {
              "title": "Start/End Frame Mastery",
              "url": "https://x.com/i/status/2007284457162846435",
              "description": "Advanced keyframe control"
            },
            {
              "title": "Hunyuan 3D-2.1",
              "url": "https://x.com/rohanpaul_ai/status/1959100811113382289?s=46",
              "description": "Flat image to 3D models"
            }
          ]
        },
        {
          "title": "💼 Events & Opportunities",
          "links": [
            {
              "title": "1 Billion Summit AI Film Award",
              "url": "https://www.1billionsummit.com/ai-film-award",
              "description": "Finalists and voting"
            },
            {
              "title": "AI Film Award Voting",
              "url": "http://aifilm.1billionsummit.com",
              "description": "Public voting platform"
            },
            {
              "title": "Wonder Film Festival Livestream",
              "url": "https://app.wonderstudios.com/c/events/film-festival-winner-livestream",
              "description": "Winner announcement and creator talks"
            },
            {
              "title": "Wonder Studios Job - Creative Lead",
              "url": "https://job-boards.eu.greenhouse.io/wonderstudios/jobs/4736732101",
              "description": "Animation project contract role"
            },
            {
              "title": "Silicon Valley Video Summit",
              "url": "https://siliconvalley.video/sign-up/",
              "description": "January 27 SF event with promo code"
            },
            {
              "title": "AI Film Award Submissions Playlist",
              "url": "https://www.youtube.com/playlist?list=PLPXkfEPXpJLrIZPYjkjyEryEw2rH-pbFc",
              "description": "Mark Wachholz's curated collection"
            }
          ]
        },
        {
          "title": "👥 New Member Profiles",
          "links": [
            {
              "title": "Stephan Bugaj - LinkedIn",
              "url": "https://www.linkedin.com/in/bugaj",
              "description": "Pixar veteran, Emmy winner, Genvid CCO"
            },
            {
              "title": "Sultan Unaspekov - LinkedIn",
              "url": "https://www.linkedin.com/in/sultan-unaspekov-751506231/",
              "description": "Higgsfield Creative Partner"
            },
            {
              "title": "Sultan - Instagram",
              "url": "https://www.instagram.com/un.sul?igsh=aTY5MXF1cmJlOTF0",
              "description": "Viral AI content creator"
            },
            {
              "title": "Andy McNamara - LinkedIn",
              "url": "https://www.linkedin.com/in/andymac3d",
              "description": "Cinesite TechX lead"
            },
            {
              "title": "Andy McNamara - Twitter",
              "url": "https://x.com/andymac3d?lang=en",
              "description": "VFX supervisor and technologist"
            }
          ]
        },
        {
          "title": "🎓 Industry Resources",
          "links": [
            {
              "title": "Higgsfield Controversy Video",
              "url": "https://www.youtube.com/watch?v=7Zj10P0Sa1k",
              "description": "Comprehensive rundown of issues"
            },
            {
              "title": "Open Source Music Model",
              "url": "https://x.com/cocktailpeanut/status/2005673873757413760",
              "description": "Alternative to Suno"
            },
            {
              "title": "Kēkā - Reflection Guide",
              "url": "https://www.demystified.ai/yearlyguide/p/2025-2026-ultimate-reflection-intention-guide-with-integration-chat-assistant",
              "description": "2025-2026 planning resource"
            },
            {
              "title": "Fairground 2025 Shoutout",
              "url": "https://www.tubefilter.com/2025/12/16/after-paying-out-100000-to-creators-in-2025-fairground-is-ready-to-advance-ai-artistry-in-2026/",
              "description": "$100k creator payouts"
            },
            {
              "title": "Kat's Podcast with MetaPuppet",
              "url": "https://open.spotify.com/show/3cy62AZcNELYEa0iZuzXWY",
              "description": "AI filmmaking conversations"
            },
            {
              "title": "Open Source Importance Discussion",
              "url": "https://youtu.be/zSvCnVi181A?si=xD3pYoErQyLT6Dkc",
              "description": "Why open source matters"
            },
            {
              "title": "Cinema Future Discussion",
              "url": "https://apple.news/AL86gsZlVQjSND8Q7iU8cEA",
              "description": "Changing viewing habits"
            },
            {
              "title": "French YouTuber Everest Documentary",
              "url": "https://www.france24.com/en/live-news/20240916-french-youtuber-hits-peak-with-everest-documentary",
              "description": "Content platform translation"
            },
            {
              "title": "AI Education Market Opportunity",
              "url": "https://www.instagram.com/reel/DTLiq85EhfH/?igsh=eGNvODUxMXBxYTFl",
              "description": "Growing education sector"
            },
            {
              "title": "Interesting AI Reading",
              "url": "https://x.com/shanaka86/status/2006980687069589841?s=46&t=ny3cTkRu7TUZVu8olxOKQQ",
              "description": "Industry analysis"
            },
            {
              "title": "DemonFlyingFox Threads Post",
              "url": "https://www.threads.com/@jaiford99/post/DTHImrhDEhQ?xmt=AQF0IviTrQylg_wWlEQup5qJ_E2nVKV9vvHfMTP45n-JhiIfKXvpqsKl4Mp3xoVycZYGX5Ho&source_surface=35&slof=1",
              "description": "Viral AI content"
            }
          ]
        }
      ]
    }
  ]
}