{
  "id": "dec16-jan7-2025",
  "title": "December 16, 2025 - January 7, 2026",
  "date": "January 7, 2026",
  "dateRange": "December 16, 2025 - January 7, 2026",
  "summary": "WAN 2.6 launches with 15-second consistency and multi-shot control, Seedance 1.5 Pro and Flux 2 Max released, Apple enters AI with image-to-Gaussian Splatting, Kling adds voice control and motion control features, Meta acquires Manus AI agent, Genvid releases The Seeker film and studio production tool, Billy Boman delivers P&G commercial adaptation with Media Monks, comprehensive upscaling and consistency techniques shared, 1 Billion Summit AI Film Award finalists announced, and RealDreams HQ welcomes Stephan Bugaj, Sultan, and Andy McNamara.",
  "stats": {
    "tools": 14,
    "tutorials": 15,
    "insights": 12,
    "links": 48
  },
  "keyHighlights": [
    "WAN 2.6 launches with 15-second consistency and multi-shot motion control",
    "Apple enters AI space with image-to-Gaussian Splatting technology",
    "Meta acquires Manus AI agent platform for $2 billion",
    "Genvid releases The Seeker GenAI film and studio production tool",
    "Billy Boman delivers P&G commercial adaptation using AI workflow with Media Monks",
    "1 Billion Summit AI Film Award finalists announced with public voting"
  ],
  "topPosters": [
    {
      "name": "David Clark",
      "count": 139
    },
    {
      "name": "Aaron Bhugobaun",
      "count": 85
    },
    {
      "name": "Billy Boman",
      "count": 78
    }
  ],
  "sections": [
    {
      "title": "🚀 Major Updates & News",
      "items": [
        {
          "title": "🎬 WAN 2.6 Released with Multi-Shot Control",
          "link": "https://wan-video.com",
          "overview": "<strong>Ludovic</strong> announces WAN 2.6 with 15-second consistency, perfect audio sync, one-prompt multi-shot control, and character/voice replication.",
          "description": "<strong>Ludovic</strong> announced WAN 2.6 on Wan-Video, highlighting major improvements: 15-second consistency with perfect audio sync, one-prompt multi-shot control, ability to replicate character ID and voice from 2-10 second clips with audio upload support, multi-character and cartoon support, and commercial-grade output quality. <strong>Ludovic</strong> demonstrated the capabilities with a first test showing multi-shot text-to-video generation in a single 15-second prompt, showcasing the system's ability to maintain consistency across multiple shots without manual editing. The single-gen dialogue prompt featured over-the-shoulder alternating perspectives with emotionally charged cinematic drama.",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🎥 Seedance 1.5 Pro Released",
          "link": "",
          "overview": "<strong>Edmond Yang</strong> and <strong>Ludovic</strong> test the new Seedance 1.5 Pro model with impressive text-to-video results.",
          "description": "<strong>Edmond Yang</strong> asked about Seedance 1.5 Pro release, and <strong>Ludovic</strong> quickly tested it, sharing impressive single-gen text-to-video results. The test demonstrated the model's capability for cinematic dialogue scenes with proper audio sync and emotional depth.",
          "posters": [
            "Edmond Yang",
            "Ludovic"
          ]
        },
        {
          "title": "🖼️ Flux 2 Max Released",
          "link": "https://bfl.ai/models/flux-2-max",
          "overview": "<strong>Luka T</strong> announces Flux 2 Max release, noting no open weights expected.",
          "description": "<strong>Luka T</strong> announced that Flux 2 Max is out, noting that open weights are not yet available and probably never will be. The release came on a day when multiple AI models dropped simultaneously, with <strong>Winston Mayo</strong> joking about everyone thinking it was safe to release on the same day.",
          "posters": [
            "Luka T",
            "Winston Mayo"
          ]
        },
        {
          "title": "🎤 Kling Voice Control Feature",
          "link": "https://app.klingai.com/global/release-notes/7trhudk78j?type=dialog",
          "overview": "<strong>Ludovic</strong> shares Kling 2.6 voice control release notes for natural language video prompting.",
          "description": "<strong>Ludovic</strong> shared the release notes for Voice Control in Kling 2.6, enabling natural language video prompting capabilities. The community discussed the feature's potential for more intuitive video generation workflows.",
          "posters": [
            "Ludovic"
          ]
        },
        {
          "title": "🍎 Apple Image-to-Gaussian Splatting",
          "link": "https://www.linkedin.com/posts/martin-nebelong_from-2-second-faster-on-higher-end-gpus-activity-7407403800929390592-Rc8U",
          "overview": "<strong>Rory Flynn</strong> and <strong>Martin Nebelong</strong> discuss Apple's entry into AI with image-to-Gaussian Splatting technology.",
          "description": "<strong>Rory Flynn</strong> shared news about Apple developing AI capabilities, noting he didn't even know Apple was in the space. <strong>Martin Nebelong</strong> demonstrated the technology, generating Gaussian Splat scenes from single images in just 2 seconds on a 4090 GPU. <strong>Justin Hackney</strong> called it \"actually huge\" that Apple has entered the chat. <strong>Martin Nebelong</strong> showed integration with Octane Render 2026, creating impressive results. <strong>ChristianF.</strong> mentioned the Marble WorldLabs integration into Octane Render 2026 for similar capabilities.",
          "posters": [
            "Rory Flynn",
            "Martin Nebelong",
            "Justin Hackney",
            "ChristianF."
          ]
        },
        {
          "title": "🤖 Meta Acquires Manus AI Agent",
          "link": "https://manus.im/blog/manus-joins-meta-for-next-era-of-innovation",
          "overview": "<strong>Kēkā</strong> and <strong>Stephan Bugaj</strong> discuss Meta's $2 billion acquisition of Manus AI agent platform.",
          "description": "<strong>Kēkā</strong> shared the news that Meta acquired Manus, expressing concern as Manus had been a daily agent tool in his work for almost a year. <strong>Stephan Bugaj</strong> noted that when Meta bought Play.ai, they stopped supporting customers entirely. <strong>Kēkā</strong> provided extensive analysis, noting Manus is still strides ahead of Google Studio as a 1-stop research-to-deployable widget builder. The acquisition was valued at $2 billion for approximately 100 people at a 3-year-old company. <strong>Rourke</strong> mentioned Meta also recently acquired Limitless, an AI wearable device. <strong>Matthieu</strong> suggested Antigravity as an alternative, though <strong>Kēkā</strong> noted Manus is better for non-dev users and multi-tool workflows.",
          "posters": [
            "Kēkā",
            "Stephan Bugaj",
            "Rourke",
            "Matthieu",
            "Aaron Bhugobaun"
          ]
        },
        {
          "title": "🎬 Genvid Releases The Seeker Film & Studio Tool",
          "link": "https://gamesbeat.com/genvid-releases-sci-fi-genai-film-the-seeker/",
          "overview": "<strong>Stephan Bugaj</strong> announces the release of The Seeker GenAI film and Genvid studio production platform.",
          "description": "<strong>Stephan Bugaj</strong>, Emmy Award winning CCO of Genvid Entertainment and Pixar veteran, announced the release of \"The Seeker,\" a 22-minute GenAI sci-fi film, along with the Genvid GenAI Studio Workflow Tool he designed. The tool supports many image and video models and allows users to bring their own API keys from Kling, Google, Minimax, LTX, Higgsfield, etc. <strong>Stephan Bugaj</strong> offered Google Meet walkthroughs for productions interested in the tool. Animation Magazine featured the release, highlighting his Innovation Emmy win and Pixar background.",
          "posters": [
            "Stephan Bugaj"
          ]
        },
        {
          "title": "🏆 1 Billion Summit AI Film Award Finalists",
          "link": "https://www.1billionsummit.com/ai-film-award",
          "overview": "<strong>Winston Mayo</strong>, <strong>Billy Boman</strong>, and <strong>Mark Wachholz</strong> discuss the AI Film Award finalists and voting process.",
          "description": "<strong>Winston Mayo</strong> announced that the list and voting for the million dollar AI film is open. <strong>Mark Wachholz</strong> was congratulated for being shortlisted. The community discussed the estimated 20,000+ submissions based on the mid-November press release. <strong>Billy Boman</strong> shared the finalists link, noting he hadn't heard of any of the creators and found the work lacking artistic flair. <strong>Mark Wachholz</strong> created a YouTube playlist attempting to collect all submissions, finding only 39 of the estimated 3,500-30,000+ entries. <strong>PJ Accetturo</strong> noted only about 2 good films in the top 10.",
          "posters": [
            "Winston Mayo",
            "Billy Boman",
            "Mark Wachholz",
            "PJ Accetturo",
            "Chris First"
          ]
        },
        {
          "title": "🎮 Kling Motion Control Feature",
          "link": "https://x.com/Kling_ai/status/2001306445262823431",
          "overview": "<strong>Sultan</strong>, <strong>Ryan Phillips</strong>, and <strong>Tobi</strong> discuss Kling's new motion control capabilities.",
          "description": "<strong>Sultan</strong> asked if anyone had played with the new Kling motion control feature. <strong>Edmond Yang</strong> and <strong>Ryan Phillips</strong> confirmed they had tested it, with <strong>Ryan Phillips</strong> calling it \"very good.\" <strong>Tobi</strong> posted tests on LinkedIn, noting it's great for semi-realistic content but often fails at more stylized characters like 3D. For hyper-realistic characters, there's still some uncanniness, though the level of micro-expressions is amazing.",
          "posters": [
            "Sultan",
            "Ryan Phillips",
            "Edmond Yang",
            "Tobi"
          ]
        },
        {
          "title": "📺 Secret Level Academy Launches",
          "link": "https://tvnewscheck.com/ai/article/secret-level-introduces-secret-level-academy-training-hollywood-for-the-ai-driven-production-era/",
          "overview": "<strong>Minh</strong> shares news of Secret Level Academy training Hollywood for AI-driven production.",
          "description": "<strong>Minh</strong> shared the announcement of Secret Level Academy, a new initiative training Hollywood for the AI-driven production era. The program aims to prepare industry professionals for the integration of AI tools into traditional production workflows.",
          "posters": [
            "Minh"
          ]
        },
        {
          "title": "🎨 Reve V11 and V11 Fast Released",
          "link": "https://www.linkedin.com/posts/reveimage_reve-v11-and-reve-v11-fast-are-here-we-activity-7407493843501318145-dT1o",
          "overview": "<strong>Jordan Daniel Chesney</strong> shares Reve V11 model release announcement.",
          "description": "<strong>Jordan Daniel Chesney</strong> shared the release of Reve V11 and Reve V11 Fast models. He later mentioned being excited to receive Reve merch, noting he begged them for it and will \"wear it too much.\" <strong>Billy Boman</strong> expressed interest in getting merch as well.",
          "posters": [
            "Jordan Daniel Chesney",
            "Billy Boman"
          ]
        },
        {
          "title": "🔺 Trellis 2 for 3D Generation",
          "link": "https://fal.ai/models/fal-ai/trellis-2",
          "overview": "<strong>Edmond Yang</strong> recommends Trellis 2 on fal.ai for 3D model generation.",
          "description": "<strong>Edmond Yang</strong> shared that he's been using Trellis 2 on fal.ai for 3D generation, calling it \"pretty good.\" <strong>Martin LeBlanc</strong> asked about the best workflow for image-to-3D model generation, and <strong>BasvdE</strong> recommended Vizcom.com for products and tripo3d.ai for characters. <strong>Martin LeBlanc</strong> tested Tripo3D and got good results even for complex models, noting the ability to move models to any angle and use NBP for final renders gives great control and consistency.",
          "posters": [
            "Edmond Yang",
            "Martin LeBlanc",
            "BasvdE"
          ]
        },
        {
          "title": "🎵 Open Source Music Model Released",
          "link": "https://x.com/cocktailpeanut/status/2005673873757413760",
          "overview": "<strong>Rory Flynn</strong> shares news of an open source music generation model.",
          "description": "<strong>Rory Flynn</strong> shared news of an open source music generation model. <strong>Winston Mayo</strong> asked if it's as good as Suno, sparking discussion about the state of AI music generation tools.",
          "posters": [
            "Rory Flynn",
            "Winston Mayo"
          ]
        },
        {
          "title": "🖼️ Qwen-Image-Edit-2511 with ComfyUI Support",
          "link": "https://x.com/i/status/2003496348461728213",
          "overview": "<strong>Ramon Guthrie</strong> announces Qwen-Image-Edit-2511 release with Day-1 ComfyUI support.",
          "description": "<strong>Ramon Guthrie</strong> announced Qwen-Image-Edit-2511 with Day-1 ComfyUI support and lightning Loras for lower hardware, calling it \"how you release a model!\" The release demonstrated best practices for model deployment with immediate community tool integration.",
          "posters": [
            "Ramon Guthrie"
          ]
        }
      ]
    },
    {
      "title": "📚 Tutorials & Techniques",
      "items": [
        {
          "title": "🎬 P&G Commercial Adaptation Workflow",
          "link": "https://www.linkedin.com/posts/billyboman_check-out-our-latest-work-in-cooperation-activity-7414634831248048128-0GqF",
          "overview": "<strong>Billy Boman</strong> shares the workflow for adapting a P&G commercial using AI with Media Monks.",
          "tutorial": {
            "tool": "WAN + Compositing",
            "workflow": "*Take existing commercial footage, run parts through WAN for character replacement, fully re-prompt other scenes for new celebrity adaptation. Generate each element as separate AI video for maximum control. Composite AI-generated elements with live action plates. Use WAN for uniform changes and lighting matching (e.g., getting soccer player into brand color appropriate uniform).*",
            "challenge": "*When replacing characters of different heights in 2-shots, WAN struggles with the size difference - requires creative workarounds.*",
            "result": "*Successfully delivered hybrid production demonstrating the power of combining AI generation with traditional VFX compositing for commercial adaptation work.*"
          },
          "posters": [
            "Billy Boman"
          ]
        },
        {
          "title": "🔍 Upscale/Digital Zoom Trick",
          "link": "https://www.linkedin.com/feed/update/urn:li:activity:7409256998900297729/",
          "overview": "<strong>Alex</strong> shares the upscale/digital zoom technique for smoothing frame-to-frame movement.",
          "tutorial": {
            "technique": "*Keep a 2× upscaled version of your video. When frame-to-frame movement feels too harsh, apply a subtle digital zoom in or out to smooth transitions.*",
            "application": "*This technique helps mask AI video artifacts and creates smoother motion between frames, particularly useful for shots with noticeable temporal inconsistencies.*"
          },
          "posters": [
            "Alex"
          ]
        },
        {
          "title": "📐 Vanishing Point Reference Technique",
          "link": "",
          "overview": "<strong>Rory Flynn</strong> demonstrates extracting vanishing points and convergence lines for consistent perspective.",
          "tutorial": {
            "tool": "Pluribus + Nano",
            "technique": "*Extract vanishing point and convergence lines from a frame using Pluribus. Apply the extracted lines to a new image as a reference. Use with Nano for perspective-consistent generation.*",
            "application": "*Useful for maintaining consistent perspective across multiple generated shots, particularly important for architectural or environmental sequences.*"
          },
          "posters": [
            "Rory Flynn"
          ]
        },
        {
          "title": "🎨 NanoBanana Multi-Element Consistency",
          "link": "",
          "overview": "<strong>Yonatan</strong> shares techniques for constructing shots with consistent multiple elements in NanoBanana.",
          "tutorial": {
            "best_practice": "*For cleaner results, add each element separately as a source. Put the mood board as a grid reference. Add other elements as singular items. A singular item can be multiple images of that item from different angles in one image.*",
            "key_principle": "*Separate reference images get cleaner results than combining everything into one image.*"
          },
          "posters": [
            "Yonatan",
            "Jovardi"
          ]
        },
        {
          "title": "🎥 Extend Clips with Freepik/Veo 2",
          "link": "",
          "overview": "<strong>Jordan Daniel Chesney</strong> shares technique for extending clips using Freepik's Veo 2 integration.",
          "tutorial": {
            "workflow": "*Generate first clip in Freepik with any model (e.g., Kling). Extend the clip in Freepik, which uses Veo 2. No noticeable jumps or quality changes between models.*",
            "result": "*Kling to Veo 2 transitions work seamlessly for extending clips, providing flexibility in model selection while maintaining visual consistency.*"
          },
          "posters": [
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎮 Higgsfield Cinema Studio Workflow",
          "link": "",
          "overview": "<strong>Rourke</strong> explores Higgsfield Cinema Studio capabilities for automated multi-angle generation.",
          "tutorial": {
            "assessment": "*Appears to be Nano Pro built on top of a prompt enhancer. Great for having fun with automated camera work and multi-angle generation.*",
            "application": "*The platform provides multi-camera angle wrapper similar to what Nano Banana Pro offers, useful for quick multi-angle shot exploration.*"
          },
          "posters": [
            "Rourke",
            "Billy Boman"
          ]
        },
        {
          "title": "🎨 ProCreate to AI Animation Workflow",
          "link": "https://x.com/martinleblanc/status/2007110933785796729",
          "overview": "<strong>Martin LeBlanc</strong> demonstrates bringing ProCreate sketches to life with NBP and Kling 2.6.",
          "tutorial": {
            "workflow": "*Sketch character in ProCreate. Process through Nano Banana Pro. Animate with Kling 2.6 for final video.*",
            "application": "*Great workflow for bringing traditional digital art to animated life, bridging the gap between hand-drawn art and AI animation.*"
          },
          "posters": [
            "Martin LeBlanc"
          ]
        },
        {
          "title": "🔺 Image to 3D Model Workflow",
          "link": "http://tripo3d.ai",
          "overview": "<strong>Martin LeBlanc</strong> and <strong>BasvdE</strong> share workflows for converting images to 3D models.",
          "tutorial": {
            "tools": "*Vizcom.com for product images. Tripo3d.ai for character models. Hunyuan 3D-2.1 turns flat images into studio-quality 3D.*",
            "rigging_prep": "*Ensure limbs are separated if planning to rig. T-pose works best for rigging purposes.*",
            "rendering_workflow": "*Move 3D model to any angle, then use NBP for final render. This provides great control and consistency.*",
            "result": "*Tripo3D gives good results even for complex models. The angle control plus NBP rendering workflow provides excellent consistency across shots.*"
          },
          "posters": [
            "Martin LeBlanc",
            "BasvdE",
            "Rory Flynn"
          ]
        },
        {
          "title": "🎬 Soul + Magnific Skin Enhance Workflow",
          "link": "",
          "overview": "<strong>Jordan Daniel Chesney</strong> shares technique for RAW UGC-looking content using Soul and Magnific.",
          "tutorial": {
            "workflow": "*Generate with Higgsfield Soul model for realism. Apply Magnific skin enhance.*",
            "result": "*Super fast method for RAW UGC iPhone-look content.*",
            "technical_note": "*Soul is proprietary (not a fine-tuning of someone else's model) and excels at realistic iPhone-style footage. Soul plus Magnific skin enhance creates authentic-looking user-generated content aesthetics.*"
          },
          "posters": [
            "Jordan Daniel Chesney",
            "Stephan Bugaj",
            "Martin LeBlanc"
          ]
        },
        {
          "title": "🔍 Visual Forensics Workflow",
          "link": "https://app.weavy.ai/flow/NJ3TenYhPduuBv6ohGHrN3?ref=rory72",
          "overview": "<strong>Rory Flynn</strong> shares a suite of system prompts for visual forensics analysis.",
          "tutorial": {
            "workflow": "*Drop in a still frame. System shoots out multiple analysis outputs. Extract various visual elements and information.*",
            "application": "*Useful for token extraction and detailed frame analysis. More for fun and exploration than production work, but reveals interesting technical details about frame composition and elements.*"
          },
          "posters": [
            "Rory Flynn",
            "Jim Phillips"
          ]
        },
        {
          "title": "🎥 AI VFX Breakdown Techniques",
          "link": "https://www.linkedin.com/posts/nitchhiltgen_vfx-ia-hybridcreativity-activity-7406593282958561280-usv0",
          "overview": "<strong>Billy Boman</strong> shares a cool AI VFX breakdown demonstrating hybrid production techniques.",
          "tutorial": {
            "approach": "*Generate each element as separate AI video. Composite AI elements with live action plates. Use AI for specific elements like dragons. Use WAN for uniform changes and lighting matching.*",
            "key_principle": "*Separate AI video generation for each element provides maximum control in hybrid productions. This allows for precise compositing and adjustment of individual elements while maintaining overall scene cohesion.*"
          },
          "posters": [
            "Billy Boman"
          ]
        },
        {
          "title": "🎮 SpriteSwap Studio - Photo to Game Boy ROM",
          "link": "https://github.com/lovisdotio/SpriteSwap-Studio",
          "overview": "<strong>Lovis Odin</strong> open-sources a tool that turns any photo into a playable Game Boy ROM using AI.",
          "tutorial": {
            "capability": "*Input any photo. AI converts to Game Boy sprite style. Outputs playable Game Boy ROM file.*",
            "application": "*Fun creative tool for retro gaming aesthetics and nostalgic content creation.*"
          },
          "posters": [
            "Lovis Odin",
            "Chris (SyntaxDiffusion)"
          ]
        },
        {
          "title": "🎬 Feature Film Production Timeline Discussion",
          "link": "",
          "overview": "<strong>Stephan Bugaj</strong>, <strong>Blvckl!ght</strong>, and <strong>Jovardi</strong> discuss realistic timelines for AI feature films.",
          "tutorial": {
            "benchmarks": "*10 minutes in 4 weeks is achievable solo. 100 minutes in 4 months is doable with experience. Stephan Bugaj did The Seeker (~20min) in 6 weeks with a sound editor, estimates 8-9 weeks solo. Could do equal quality in a month now with learnings.*",
            "quality_factors": "*Include sound design, original score, and grading. Script quality is essential - don't bother without great script. For client work, multiply everything by 10x.*",
            "cost_reality": "*$5k for 100 minutes is unrealistic - barely covers generation costs. $100k+ is more realistic for quality feature-length work. Anyone saying \"Pixar quality for $5,000\" is clearly hallucinating.*"
          },
          "posters": [
            "Stephan Bugaj",
            "Blvckl!ght",
            "Jovardi",
            "Chad Nelson",
            "Winston Mayo",
            "Adrian Daniel Botnariu"
          ]
        },
        {
          "title": "🎨 Octane Render 2026 + Gaussian Splat Integration",
          "link": "",
          "overview": "<strong>Martin Nebelong</strong> and <strong>ChristianF.</strong> discuss Octane Render 2026 Gaussian Splat capabilities.",
          "tutorial": {
            "workflow": "*Use Apple's image-to-Gaussian Splatting or WorldLabs. Import Gaussian Splat output into Octane Render 2026. Work directly in C4D or Octane Render. Marble WorldLabs integration available with Black Friday coupon.*",
            "performance": "*Generates scenes from single images in 2 seconds on high-end GPUs (4090).*"
          },
          "posters": [
            "Martin Nebelong",
            "ChristianF.",
            "Rory Flynn"
          ]
        },
        {
          "title": "🎬 Start and End Frame Mastery",
          "link": "https://x.com/i/status/2007284457162846435",
          "overview": "<strong>Jordan Daniel Chesney</strong> shares impressive start and end frame control techniques.",
          "tutorial": {
            "technique": "*Master start frame composition. Plan end frame for seamless transitions. Use keyframes strategically for control.*",
            "principle": "*Proper start/end frame planning is crucial for professional results and seamless shot transitions in AI video generation.*"
          },
          "posters": [
            "Jordan Daniel Chesney"
          ]
        }
      ]
    },
    {
      "title": "🎨 Community Showcases & Projects",
      "items": [
        {
          "title": "🎬 Billy Boman - Storytytel Campfire AI Film",
          "link": "https://www.linkedin.com/posts/billyboman_%F0%9D%97%A6%F0%9D%98%81%F0%9D%97%BC%F0%9D%97%BF%F0%9D%98%86%F0%9D%98%81%F0%9D%97%B2%F0%9D%97%B9-%F0%9D%97%96%F0%9D%97%AE%F0%9D%97%BA%F0%9D%97%BD%F0%9D%97%B3%F0%9D%97%B6%F0%9D%97%BF%F0%9D%97%B2-%F0%9D%97%94%F0%9D%97%9C-%F0%9D%97%99-activity-7407770304313450496-2w_p",
          "overview": "<strong>Billy Boman</strong> shares Storytytel Campfire AI Film project with distributed team.",
          "description": "<strong>Billy Boman</strong> shared the Storytytel Campfire AI Film, describing it as a labor of love and one of the first projects with a wider distributed team as they scale to a boutique studio offering. <strong>Jordan Daniel Chesney</strong> called it \"unbelievably cool\" and praised how <strong>Billy Boman</strong> \"wrestled the clients wishes to the ground and gently choked them out into a gentle slumber of high-quality storytelling.\"",
          "posters": [
            "Billy Boman",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎄 Blvckl!ght - 70s Claymation Holiday Video",
          "link": "https://x.com/blvcklightai/status/2003299872435585378",
          "overview": "<strong>Blvckl!ght</strong> creates a 70s claymation-style Christmas animation.",
          "description": "<strong>Blvckl!ght</strong> shared a 70s claymation holiday video, with <strong>Chris First</strong> praising the \"immaculate vibes\" that remind him of childhood Christmas animations, calling it \"so normal, like it's a Christmas classic.\" <strong>Blvckl!ght</strong> also received a shoutout from Fairground for his work with them throughout 2025.",
          "posters": [
            "Blvckl!ght",
            "Chris First"
          ]
        },
        {
          "title": "🎬 Alex - Christmas Short Film",
          "link": "https://www.linkedin.com/feed/update/urn:li:activity:7409256998900297729/",
          "overview": "<strong>Alex</strong> shares an ambitious Christmas short film with warm daylight aesthetics.",
          "description": "<strong>Alex</strong> shared his most ambitious short to date, with <strong>Jordan Daniel Chesney</strong> praising the aesthetics and feeling of warmth in the daylight. <strong>Alex</strong> acknowledged imperfections but noted \"at one point, you gotta post.\" He also shared that one of his videos (jellyfish turning into a flower) made it into an OpenAI promotional post.",
          "posters": [
            "Alex",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🥷 Sultan - Naruto Trailer",
          "link": "https://www.instagram.com/reel/DSlQHFbjJYt/?igsh=endrcjFxZHRscTcy",
          "overview": "<strong>Sultan</strong> shares his viral Naruto trailer that faced copyright issues.",
          "description": "<strong>Sultan</strong> shared his Naruto trailer, noting he had to reupload it due to a copyright scam with fake right owners. Higgsfield is investigating who filed the strike. <strong>Sultan</strong>'s work has gone viral with hundreds of millions of views, including a kangaroo UFC clip.",
          "posters": [
            "Sultan"
          ]
        },
        {
          "title": "🎬 Yonatan - King of The Streets Collab",
          "link": "https://www.instagram.com/reel/DSarJ10DIlA/",
          "overview": "<strong>Yonatan</strong> shares collaboration video with King of The Streets.",
          "description": "<strong>Yonatan</strong> shared their latest video in collaboration with King of The Streets. <strong>Jordan Daniel Chesney</strong> praised it as \"next level\" with \"Gaspar Noe vibes.\"",
          "posters": [
            "Yonatan",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎬 Ari Kuschnir - 1 Billion Summit Entry",
          "link": "https://youtu.be/6J8qpqGBSww?si=e81H334N2yFUFAQM",
          "overview": "<strong>Ari Kuschnir</strong> shares his most ambitious short for the 1 Billion Summit.",
          "description": "<strong>Ari Kuschnir</strong> shared his most ambitious short to date, a story his friend David Sauvage had last summer that they decided to make for the 1 Billion Summit. He noted learning a lot and pushing as much as he could.",
          "posters": [
            "Ari Kuschnir"
          ]
        },
        {
          "title": "🎬 David Clark - 2025 Swan Song",
          "link": "https://youtu.be/s5qIfjjtjGc?si=ziugz68kk-dgGegq",
          "overview": "<strong>David Clark</strong> shares his 2025 swan song video.",
          "description": "<strong>David Clark</strong> shared his 2025 swan song video as a year-end creative piece. He was also invited by Google for a Sundance panel but will be knee deep in production.",
          "posters": [
            "David Clark"
          ]
        },
        {
          "title": "🎬 Junie - ByteDance New Year Film",
          "link": "https://www.instagram.com/reel/DS4opEwD9US/?igsh=MWYzdzkwN2h4dXB0bg==",
          "overview": "<strong>Junie</strong> creates New Year short film \"One Blink\" for ByteDance.",
          "description": "<strong>Junie</strong> shared that ByteDance invited her to create the New Year short film \"One Blink,\" a light sci-fi love story. She wished everyone a happy New Year with hopes for genuine love in the year ahead.",
          "posters": [
            "Junie"
          ]
        },
        {
          "title": "🎬 Rourke - AI 2025 Reflections",
          "link": "https://www.instagram.com/p/DS5OJ45DMRN/",
          "overview": "<strong>Rourke</strong> shares \"AI fucked up everything in 2025\" final thoughts video.",
          "description": "<strong>Rourke</strong> shared his final thoughts for 2025 with a clever loop video. <strong>Yonatan</strong> praised the clever loop technique.",
          "posters": [
            "Rourke",
            "Yonatan"
          ]
        },
        {
          "title": "🎬 PJ Accetturo - Big Trailer",
          "link": "https://x.com/PJaccetturo/status/2008559114704875888",
          "overview": "<strong>PJ Accetturo</strong> announces \"Big Trailer PJ is back\" with new trailer release.",
          "description": "<strong>PJ Accetturo</strong> announced his return with a new trailer, with <strong>Matthiei</strong> suggesting Hunter Schaffer for even more engagement.",
          "posters": [
            "PJ Accetturo",
            "Matthiei"
          ]
        },
        {
          "title": "🎨 Matthieu - Ross Lovegrove AI Chair Design",
          "link": "https://www.dezeen.com/2025/12/19/ross-lovegrove-google-deepmind-ai-chair-design/",
          "overview": "<strong>Matthieu</strong> shares collaboration with Ross Lovegrove on AI-designed chair featured in Dezeen.",
          "description": "<strong>Matthieu</strong> shared that their collaboration with Ross Lovegrove on an AI-design chair was recently featured in Dezeen. He also mentioned his video for CES aired.",
          "posters": [
            "Matthieu"
          ]
        },
        {
          "title": "🎬 Jovardi - Dubai Competition Entry",
          "link": "https://youtu.be/xiprjuEnAp8",
          "overview": "<strong>Jovardi</strong> shares 10-minute film created in 3-4 weeks for Dubai competition.",
          "description": "<strong>Jovardi</strong> shared his Dubai competition entry, noting it was done in about 3-4 weeks including sound design, original score, and grading. For client work, he would 10x everything.",
          "posters": [
            "Jovardi"
          ]
        }
      ]
    },
    {
      "title": "👋 New Members",
      "items": [
        {
          "title": "🎬 Stephan Bugaj - Pixar Veteran & Genvid CCO",
          "link": "https://www.linkedin.com/in/bugaj",
          "overview": "<strong>Justin Hackney</strong> welcomes Emmy Award winning CCO of Genvid Entertainment, formerly of Pixar, Telltale, DJ2 Entertainment, Hanson Robotics, and Bell Labs.",
          "description": "<strong>Justin Hackney</strong> introduced <strong>Stephan Bugaj</strong>, describing his ridiculous background across tech, films, animation, games, and now diving deep into AI. Stephan's 22-minute GenAI film \"The Seeker\" went public along with the Genvid GenAI Studio Workflow Tool he designed. The community warmly welcomed him with messages from <strong>Ludovic</strong>, <strong>Jordan Daniel Chesney</strong>, <strong>Aaron Bhugobaun</strong>, <strong>Henry</strong>, and many others.",
          "posters": [
            "Justin Hackney",
            "Stephan Bugaj"
          ]
        },
        {
          "title": "🎬 Sultan Unaspekov - Higgsfield Creative Partner",
          "link": "https://www.linkedin.com/in/sultan-unaspekov-751506231/",
          "overview": "<strong>Aaron Bhugobaun</strong> welcomes <strong>Sultan</strong>, viral AI creator with hundreds of millions of views.",
          "description": "<strong>Aaron Bhugobaun</strong> introduced <strong>Sultan Unaspekov</strong>, noting his journey from running around film sets as a kid to producing commercial work across Europe. After experimenting with Kling, Minimax, and ComfyUI, <strong>Sultan</strong> joined Higgsfield as a Creative Partner, creating boundary-pushing demos. His work includes a viral MrBeast spec and a kangaroo UFC clip with hundreds of millions of views.",
          "posters": [
            "Aaron Bhugobaun",
            "Sultan"
          ]
        },
        {
          "title": "🎬 Andy McNamara - Cinesite TechX Lead",
          "link": "https://www.linkedin.com/in/andymac3d",
          "overview": "<strong>Aaron Bhugobaun</strong> welcomes <strong>Andy</strong>, award-winning CG & VFX Supervisor with 35+ years experience.",
          "description": "<strong>Aaron Bhugobaun</strong> introduced <strong>Andy McNamara</strong>, an award-winning CG & VFX Supervisor, Creative Director, and Technologist with 35+ years at the sharp end of creative media. He's led CGI and VFX teams at BBC, Publicis, Prime Focus, and Cinesite. Now driving TechX, Cinesite's generative AI initiative, exploring how AI will shape the next era of filmmaking across VFX, feature animation, and immersive storytelling.",
          "posters": [
            "Aaron Bhugobaun",
            "Andy"
          ]
        }
      ]
    },
    {
      "title": "💼 Professional Opportunities",
      "items": [
        {
          "title": "📺 TV Show Crowd Shots - Runway/Nuke Required",
          "link": "",
          "overview": "<strong>Jordan Daniel Chesney</strong> announces full-time contract work for 200 crowd shots on a TV show.",
          "description": "<strong>Jordan Daniel Chesney</strong> announced a job opportunity for full-time contract work on a TV show requiring 200 crowd shots. Must be done with Runway and requires familiarity with Nuke as well as fluency with AI. Starts first week of January.",
          "posters": [
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎬 Wonder Studios Animation Project Roles",
          "link": "https://job-boards.eu.greenhouse.io/wonderstudios/jobs/4736732101",
          "overview": "<strong>Harry</strong> announces contract roles for Wonder Studios animation project.",
          "description": "<strong>Harry</strong> announced Wonder Studios is looking for contract roles for an animation project: Creative Lead (focused on execution, visual consistency, and quality control) and Production Lead (to run schedule, team coordination, and feedback cycles). Fixed-term project from January to May, hands-on roles.",
          "posters": [
            "Harry"
          ]
        },
        {
          "title": "🎪 GCSC Future Studio Event - London",
          "link": "",
          "overview": "<strong>Aaron Bhugobaun</strong> announces GCSC Future Studio event at Google Kings Cross office in February.",
          "description": "<strong>Aaron Bhugobaun</strong> announced another GCSC Future Studio event in London at Google Kings Cross office in February, with open invitation to all. He's also planning sessions and welcomes anyone who wants to participate.",
          "posters": [
            "Aaron Bhugobaun"
          ]
        },
        {
          "title": "🎬 Wonder Film Festival Winner Livestream",
          "link": "https://app.wonderstudios.com/c/events/film-festival-winner-livestream",
          "overview": "<strong>Justin Hackney</strong> announces Wonder Film Festival winner livestream and future creator conversations.",
          "description": "<strong>Justin Hackney</strong> announced plans for livestream sessions with creators, starting with the Film Festival winner. He expressed interest in going \"deep down the rabbit hole\" beyond just film/process discussions, exploring topics ranging from work to the singularity. A poll showed 18 votes for interest in livestream sessions.",
          "posters": [
            "Justin Hackney"
          ]
        },
        {
          "title": "🎯 Silicon Valley Video Summit",
          "link": "https://siliconvalley.video/sign-up/",
          "overview": "<strong>Gabe Michael</strong> shares free registration for Silicon Valley Video Summit on January 27.",
          "description": "<strong>Gabe Michael</strong> shared information about the 2026 Silicon Valley Video Summit on January 27 in SF. Free registration available to qualified applicants until January 15, then $150. Promo code \"SVVS2026\" bypasses payment after January 15.",
          "posters": [
            "Gabe Michael"
          ]
        },
        {
          "title": "🎬 CES and 1 Billion Film Summit Attendance",
          "link": "",
          "overview": "Community members coordinate attendance at CES and 1 Billion Film Summit in Dubai.",
          "description": "Multiple community members coordinated attendance at major events. <strong>Chris First</strong> asked about Dubai attendance for 1BFS, <strong>Avocado Papi</strong> confirmed being at CES until the 10th and attending the Lionsgate party, <strong>Kleverov</strong> and <strong>Stephan Bugaj</strong> confirmed CES attendance. <strong>David Clark</strong> noted his co-founder George will be on a panel at 1BFS.",
          "posters": [
            "Chris First",
            "Avocado Papi",
            "Kleverov",
            "Stephan Bugaj",
            "David Clark"
          ]
        }
      ]
    },
    {
      "title": "💬 Industry Discussions & Insights",
      "items": [
        {
          "title": "🎬 AI Film Quality and Plateau Discussion",
          "link": "",
          "overview": "Community debates whether AI creative tools have reached a plateau with photorealism achieved.",
          "description": "<strong>Rourke</strong> raised the question of whether AI creative tools have plateaued, noting \"we're literally at photo realism on all fronts.\" <strong>Rory Flynn</strong> suggested video and 3D/4D will go much heavier. <strong>Carl-Johann Simon-Gabriel</strong> noted audio and sound design still have lots of progress ahead, with innovation coming in editing capabilities and controllability. <strong>BasvdE</strong> shared predictions for 2026 including worldbuilding platforms, brand worlds, YouTube Games, home robots, and major studio AI series launches.",
          "posters": [
            "Rourke",
            "Rory Flynn",
            "Carl-Johann Simon-Gabriel",
            "BasvdE",
            "Kēkā"
          ]
        },
        {
          "title": "💰 AI Film Pricing and Timeline Realities",
          "link": "",
          "overview": "Community discusses realistic pricing and timelines for AI film production.",
          "description": "Discussion sparked by people promising 100-minute animated movies in 4 months for $5,000. <strong>Stephan Bugaj</strong> noted it's doable if you're good at all disciplines, don't charge for your own time, and make creative compromises - but excellent results are unlikely. <strong>Blvckl!ght</strong> confirmed 100 mins in 4 months is doable with experience, having done 90 mins in 30 days. <strong>Adrian Daniel Botnariu</strong> estimated 6 months for comfortable quality at $250k+. <strong>Rory Flynn</strong> noted $5k barely covers generation costs. The consensus: anyone saying \"Pixar quality for $5,000\" is clearly hallucinating.",
          "posters": [
            "Stephan Bugaj",
            "Blvckl!ght",
            "Adrian Daniel Botnariu",
            "Rory Flynn",
            "Winston Mayo",
            "Chad Nelson"
          ]
        },
        {
          "title": "⚠️ Higgsfield Controversies",
          "link": "https://www.youtube.com/watch?v=7Zj10P0Sa1k",
          "overview": "Community discusses ongoing Higgsfield controversies including pricing tricks and marketing stunts.",
          "description": "<strong>Yonatan</strong> exposed a pricing trick where he paid $79 for 4,210 credits while they advertise $89 for 6,000 credits - paying 26-27% more per credit with misleading UI language. <strong>Blair</strong> noted it \"feels like it's run by a scam call centre.\" <strong>Blvckl!ght</strong> shared a YouTube video documenting the issues. <strong>Billy Boman</strong> dubbed it \"Cringefield - the AI Scamcenter.\" Despite controversies, <strong>Jordan Daniel Chesney</strong> noted Higgi Soul is still a wonderful model for realistic UGC content.",
          "posters": [
            "Yonatan",
            "Blair",
            "Blvckl!ght",
            "Billy Boman",
            "Jordan Daniel Chesney"
          ]
        },
        {
          "title": "🎬 Cinema's Future and Viewing Habits",
          "link": "https://apple.news/AL86gsZlVQjSND8Q7iU8cEA",
          "overview": "Discussion on changing audience viewing habits and cinema's future.",
          "description": "<strong>Chad Nelson</strong> shared thoughts on cinema becoming like opera houses - respected but no longer mainstream. His nephews (ages 6-12) have zero interest in theater movies unless on phones/iPads. <strong>Aaron Bhugobaun</strong> noted audience viewing habits have changed and will keep changing, driven by likes and followers. <strong>Jovardi</strong> disagreed, distinguishing between creation (pen and paper is enough) and viewing (getting inspired by others' perspectives). Discussion touched on YouTube's potential TV-channel functions and emerging exhibition platforms.",
          "posters": [
            "Chad Nelson",
            "Aaron Bhugobaun",
            "Jovardi"
          ]
        },
        {
          "title": "🤝 Community and Competition in 2026",
          "link": "",
          "overview": "Discussion on the importance of community as AI competition intensifies.",
          "description": "<strong>Alex</strong> predicted 2026 will be fiercely competitive with giants trying to crush everyone in winner-takes-all dynamics (referencing The Black Swan by Nassim Nicholas Taleb). He emphasized sticking together, building strong networks, and supporting one another. <strong>Blvckl!ght</strong> agreed that 2025 was the year to form relationships and weed out the less serious from those with true drive, grit, and creativity.",
          "posters": [
            "Alex",
            "Blvckl!ght"
          ]
        },
        {
          "title": "⚠️ Recraft.ai Payment Warning",
          "link": "",
          "overview": "<strong>Robert O'Shaugnessy</strong> warns about Recraft.ai ghosting on sponsored video payment.",
          "description": "<strong>Robert O'Shaugnessy</strong> shared a word of caution about doing a sponsored video with Recraft.ai - they ghosted him on communications and payment after the video went live. <strong>Billy Boman</strong> thanked him for sharing and calling them out. <strong>Winston Mayo</strong> asked how to prevent companies from taking advantage of creators.",
          "posters": [
            "Robert O'Shaugnessy",
            "Billy Boman",
            "Winston Mayo"
          ]
        },
        {
          "title": "💼 LinkedIn Premium Discussion",
          "link": "",
          "overview": "Community discusses whether LinkedIn Premium is worth it for creators.",
          "description": "<strong>Alex</strong> asked if LinkedIn Premium is worth it. <strong>Billy Boman</strong> said no from his experience, gaining almost 16k subscribers organically in 2025 without premium. <strong>Rory Flynn</strong> noted less reach since going premium and more shadow bans, with LinkedIn mistaking virality for bot activity. <strong>Kat Gellein Viken</strong> agreed it killed her reach for ages. <strong>Chad Nelson</strong> noted it's more suited for recruiters and employers than individuals.",
          "posters": [
            "Alex",
            "Billy Boman",
            "Rory Flynn",
            "Kat Gellein Viken",
            "Chad Nelson"
          ]
        },
        {
          "title": "🎬 AI vs Authenticity Discussion",
          "link": "",
          "overview": "<strong>Billy Boman</strong> shares take on AI vs authenticity with premium/luxury lens.",
          "description": "<strong>Billy Boman</strong> shared what he called one of the best takes on AI vs \"Authenticity\" with a premium/luxury lens. <strong>Aaron Bhugobaun</strong> highlighted the key line: \"The real thing that is getting replaced is the act of being average.\" <strong>Chad Nelson</strong> added \"No place for lazy creative in the new world.\"",
          "posters": [
            "Billy Boman",
            "Aaron Bhugobaun",
            "Chad Nelson",
            "Adrian Daniel Botnariu"
          ]
        },
        {
          "title": "🎬 AI Film Editing Quality Discussion",
          "link": "",
          "overview": "<strong>Martin LeBlanc</strong> analyzes what's missing in 1 Billion Summit submissions.",
          "description": "<strong>Martin LeBlanc</strong> asked what's missing to elevate the 1 Billion Summit submissions. He identified proper editing as the key element missing in most films - too long cuts, many clips in slow-motion, and poorly written/unnatural dialogue. The discussion highlighted the importance of traditional filmmaking craft even with AI generation tools.",
          "posters": [
            "Martin LeBlanc",
            "PJ Accetturo",
            "Blair"
          ]
        },
        {
          "title": "🎓 AI Education Market Opportunity",
          "link": "https://www.instagram.com/reel/DTLiq85EhfH/?igsh=eGNvODUxMXBxYTFl",
          "overview": "<strong>Yonatan</strong> and community discuss the massive opportunity in AI education.",
          "description": "<strong>Billy Boman</strong> noted more joining the AI education game. <strong>Yonatan</strong> revealed they have 10,000 people on the waiting list for educational content with estimated $4M-$18M income potential, but need good tutorial producers. <strong>Billy Boman</strong> suggested <strong>Rourke</strong>, Simon Meyer, <strong>Rory Flynn</strong>, and <strong>Albert Bozesan</strong> as fantastic creators. <strong>David Clark</strong> noted Curious Refuge is thriving in 170+ countries but takes lots of effort and daily updates.",
          "posters": [
            "Yonatan",
            "Billy Boman",
            "Albert Bozesan",
            "Rourke",
            "David Clark"
          ]
        },
        {
          "title": "🎬 AI Company Acquisitions and Alternatives",
          "link": "",
          "overview": "Discussion on Meta's acquisition strategy and finding alternative tools.",
          "description": "Following Meta's acquisition of Manus, the community discussed the pattern of Meta buying AI companies and discontinuing customer support (Play.ai example). <strong>Matthieu</strong> suggested Antigravity as an alternative. <strong>Rourke</strong> noted Meta also acquired Limitless AI wearable. The discussion highlighted concerns about relying on tools that might be acquired and shut down.",
          "posters": [
            "Kēkā",
            "Stephan Bugaj",
            "Matthieu",
            "Rourke"
          ]
        },
        {
          "title": "🎬 Future of Creative Work Discussion",
          "link": "",
          "overview": "<strong>Chad Nelson</strong> discusses universal tools and exploring personal imagination.",
          "description": "<strong>Chad Nelson</strong> predicted that when universal tools/engines are available, people will explore their own imagination without need for external creators. He noted it's more fun to explore your own imagination unless you like/agree with the creator, find them truly entertaining and genuine, and feel they \"get you.\" His 8-year-old nephew said \"you cannot trust Disney or Pixar because they don't like Mr Beast, and Netflix is cooler.\" The discussion explored the generational shift in content consumption and creation.",
          "posters": [
            "Chad Nelson",
            "Aaron Bhugobaun",
            "Jovardi"
          ]
        }
      ]
    },
    {
      "title": "🔗 Links & Resources",
      "categories": [
        {
          "title": "🛠️ Tool Releases & Updates",
          "links": [
            {
              "title": "WAN 2.6 Release",
              "url": "https://wan-video.com",
              "description": "15-second consistency with multi-shot control"
            },
            {
              "title": "Flux 2 Max",
              "url": "https://bfl.ai/models/flux-2-max",
              "description": "Latest image generation model"
            },
            {
              "title": "Kling Voice Control Release Notes",
              "url": "https://app.klingai.com/global/release-notes/7trhudk78j?type=dialog",
              "description": "Natural language video prompting"
            },
            {
              "title": "Kling Motion Control",
              "url": "https://x.com/Kling_ai/status/2001306445262823431",
              "description": "New motion control capabilities"
            },
            {
              "title": "Reve V11 Release",
              "url": "https://www.linkedin.com/posts/reveimage_reve-v11-and-reve-v11-fast-are-here-we-activity-7407493843501318145-dT1o",
              "description": "V11 and V11 Fast models"
            },
            {
              "title": "Trellis 2 on fal.ai",
              "url": "https://fal.ai/models/fal-ai/trellis-2",
              "description": "3D model generation"
            },
            {
              "title": "Tripo3D",
              "url": "http://tripo3d.ai",
              "description": "Image to 3D conversion"
            },
            {
              "title": "Qwen-Image-Edit-2511",
              "url": "https://x.com/i/status/2003496348461728213",
              "description": "Day-1 ComfyUI support"
            },
            {
              "title": "SpriteSwap Studio (Open Source)",
              "url": "https://github.com/lovisdotio/SpriteSwap-Studio",
              "description": "Photo to Game Boy ROM converter"
            }
          ]
        },
        {
          "title": "📰 News & Announcements",
          "links": [
            {
              "title": "Meta Acquires Manus",
              "url": "https://manus.im/blog/manus-joins-meta-for-next-era-of-innovation",
              "description": "$2 billion AI agent acquisition"
            },
            {
              "title": "Apple Gaussian Splatting Demo",
              "url": "https://www.linkedin.com/posts/martin-nebelong_from-2-second-faster-on-higher-end-gpus-activity-7407403800929390592-Rc8U",
              "description": "Image-to-3D in 2 seconds"
            },
            {
              "title": "The Seeker Film Release",
              "url": "https://gamesbeat.com/genvid-releases-sci-fi-genai-film-the-seeker/",
              "description": "Genvid's 22-minute GenAI film"
            },
            {
              "title": "The Seeker - Animation Magazine",
              "url": "https://www.animationmagazine.net/2025/12/innovation-emmy-winner-pixar-vet-releases-ai-animated-short-the-seeker/",
              "description": "Emmy winner coverage"
            },
            {
              "title": "Secret Level Academy Launch",
              "url": "https://tvnewscheck.com/ai/article/secret-level-introduces-secret-level-academy-training-hollywood-for-the-ai-driven-production-era/",
              "description": "Hollywood AI training program"
            },
            {
              "title": "Ross Lovegrove AI Chair - Dezeen",
              "url": "https://www.dezeen.com/2025/12/19/ross-lovegrove-google-deepmind-ai-chair-design/",
              "description": "AI-designed furniture collaboration"
            },
            {
              "title": "OpenAI Promotional Post (Alex's Work)",
              "url": "https://x.com/OpenAI/status/2003594025098785145",
              "description": "Jellyfish to flower transformation"
            }
          ]
        },
        {
          "title": "🎨 Community Showcases",
          "links": [
            {
              "title": "Billy Boman - Storytytel Campfire",
              "url": "https://www.linkedin.com/posts/billyboman_%F0%9D%97%A6%F0%9D%98%81%F0%9D%97%BC%F0%9D%97%BF%F0%9D%98%86%F0%9D%98%81%F0%9D%97%B2%F0%9D%97%B9-%F0%9D%97%96%F0%9D%97%AE%F0%9D%97%BA%F0%9D%97%BD%F0%9D%97%B3%F0%9D%97%B6%F0%9D%97%BF%F0%9D%97%B2-%F0%9D%97%94%F0%9D%97%9C-%F0%9D%97%99-activity-7407770304313450496-2w_p",
              "description": "Distributed team AI film project"
            },
            {
              "title": "Billy Boman - Hybrid VFX Production",
              "url": "https://www.linkedin.com/posts/billyboman_check-out-our-latest-work-in-cooperation-activity-7414634831248048128-0GqF",
              "description": "P&G commercial with Media Monks"
            },
            {
              "title": "Blvckl!ght - Holiday Claymation",
              "url": "https://x.com/blvcklightai/status/2003299872435585378",
              "description": "70s claymation Christmas video"
            },
            {
              "title": "Alex - Christmas Short",
              "url": "https://www.linkedin.com/feed/update/urn:li:activity:7409256998900297729/",
              "description": "Ambitious short with upscale technique"
            },
            {
              "title": "Sultan - Naruto Trailer",
              "url": "https://www.instagram.com/reel/DSlQHFbjJYt/?igsh=endrcjFxZHRscTcy",
              "description": "Viral anime adaptation"
            },
            {
              "title": "Yonatan - King of The Streets",
              "url": "https://www.instagram.com/reel/DSarJ10DIlA/",
              "description": "Gaspar Noe vibes collaboration"
            },
            {
              "title": "Ari Kuschnir - 1 Billion Summit Entry",
              "url": "https://youtu.be/6J8qpqGBSww?si=e81H334N2yFUFAQM",
              "description": "Most ambitious short to date"
            },
            {
              "title": "David Clark - 2025 Swan Song",
              "url": "https://youtu.be/s5qIfjjtjGc?si=ziugz68kk-dgGegq",
              "description": "Year-end creative piece"
            },
            {
              "title": "Junie - ByteDance New Year Film",
              "url": "https://www.instagram.com/reel/DS4opEwD9US/?igsh=MWYzdzkwN2h4dXB0bg==",
              "description": "One Blink sci-fi love story"
            },
            {
              "title": "Rourke - AI 2025 Reflections",
              "url": "https://www.instagram.com/p/DS5OJ45DMRN/",
              "description": "Clever loop final thoughts"
            },
            {
              "title": "PJ Accetturo - Big Trailer",
              "url": "https://x.com/PJaccetturo/status/2008559114704875888",
              "description": "Big Trailer PJ returns"
            },
            {
              "title": "Jovardi - Dubai Competition",
              "url": "https://youtu.be/xiprjuEnAp8",
              "description": "10-minute film in 3-4 weeks"
            },
            {
              "title": "Martin LeBlanc - ProCreate to AI",
              "url": "https://x.com/martinleblanc/status/2007110933785796729",
              "description": "Sketch to animation workflow"
            }
          ]
        },
        {
          "title": "📚 Tutorials & Workflows",
          "links": [
            {
              "title": "AI VFX Breakdown",
              "url": "https://www.linkedin.com/posts/nitchhiltgen_vfx-ia-hybridcreativity-activity-7406593282958561280-usv0",
              "description": "Hybrid production techniques"
            },
            {
              "title": "Rory Flynn - Visual Forensics Workflow",
              "url": "https://app.weavy.ai/flow/NJ3TenYhPduuBv6ohGHrN3?ref=rory72",
              "description": "System prompts for frame analysis"
            },
            {
              "title": "Paul Trillo - Etherea BTS",
              "url": "https://www.linkedin.com/posts/paul-trillo-544b268_etherea-was-inspired-by-the-pareidolia-phenomenon-activity-7413979466537811968-4fXk",
              "description": "Behind the scenes workflow"
            },
            {
              "title": "Start/End Frame Mastery",
              "url": "https://x.com/i/status/2007284457162846435",
              "description": "Advanced keyframe control"
            },
            {
              "title": "Hunyuan 3D-2.1",
              "url": "https://x.com/rohanpaul_ai/status/1959100811113382289?s=46",
              "description": "Flat image to 3D models"
            }
          ]
        },
        {
          "title": "💼 Events & Opportunities",
          "links": [
            {
              "title": "1 Billion Summit AI Film Award",
              "url": "https://www.1billionsummit.com/ai-film-award",
              "description": "Finalists and voting"
            },
            {
              "title": "AI Film Award Voting",
              "url": "http://aifilm.1billionsummit.com",
              "description": "Public voting platform"
            },
            {
              "title": "Wonder Film Festival Livestream",
              "url": "https://app.wonderstudios.com/c/events/film-festival-winner-livestream",
              "description": "Winner announcement and creator talks"
            },
            {
              "title": "Wonder Studios Job - Creative Lead",
              "url": "https://job-boards.eu.greenhouse.io/wonderstudios/jobs/4736732101",
              "description": "Animation project contract role"
            },
            {
              "title": "Silicon Valley Video Summit",
              "url": "https://siliconvalley.video/sign-up/",
              "description": "January 27 SF event with promo code"
            },
            {
              "title": "AI Film Award Submissions Playlist",
              "url": "https://www.youtube.com/playlist?list=PLPXkfEPXpJLrIZPYjkjyEryEw2rH-pbFc",
              "description": "Mark Wachholz's curated collection"
            }
          ]
        },
        {
          "title": "👥 New Member Profiles",
          "links": [
            {
              "title": "Stephan Bugaj - LinkedIn",
              "url": "https://www.linkedin.com/in/bugaj",
              "description": "Pixar veteran, Emmy winner, Genvid CCO"
            },
            {
              "title": "Sultan Unaspekov - LinkedIn",
              "url": "https://www.linkedin.com/in/sultan-unaspekov-751506231/",
              "description": "Higgsfield Creative Partner"
            },
            {
              "title": "Sultan - Instagram",
              "url": "https://www.instagram.com/un.sul?igsh=aTY5MXF1cmJlOTF0",
              "description": "Viral AI content creator"
            },
            {
              "title": "Andy McNamara - LinkedIn",
              "url": "https://www.linkedin.com/in/andymac3d",
              "description": "Cinesite TechX lead"
            },
            {
              "title": "Andy McNamara - Twitter",
              "url": "https://x.com/andymac3d?lang=en",
              "description": "VFX supervisor and technologist"
            }
          ]
        },
        {
          "title": "🎓 Industry Resources",
          "links": [
            {
              "title": "Higgsfield Controversy Video",
              "url": "https://www.youtube.com/watch?v=7Zj10P0Sa1k",
              "description": "Comprehensive rundown of issues"
            },
            {
              "title": "Open Source Music Model",
              "url": "https://x.com/cocktailpeanut/status/2005673873757413760",
              "description": "Alternative to Suno"
            },
            {
              "title": "Kēkā - Reflection Guide",
              "url": "https://www.demystified.ai/yearlyguide/p/2025-2026-ultimate-reflection-intention-guide-with-integration-chat-assistant",
              "description": "2025-2026 planning resource"
            },
            {
              "title": "Fairground 2025 Shoutout",
              "url": "https://www.tubefilter.com/2025/12/16/after-paying-out-100000-to-creators-in-2025-fairground-is-ready-to-advance-ai-artistry-in-2026/",
              "description": "$100k creator payouts"
            },
            {
              "title": "Kat's Podcast with MetaPuppet",
              "url": "https://open.spotify.com/show/3cy62AZcNELYEa0iZuzXWY",
              "description": "AI filmmaking conversations"
            },
            {
              "title": "Open Source Importance Discussion",
              "url": "https://youtu.be/zSvCnVi181A?si=xD3pYoErQyLT6Dkc",
              "description": "Why open source matters"
            },
            {
              "title": "Cinema Future Discussion",
              "url": "https://apple.news/AL86gsZlVQjSND8Q7iU8cEA",
              "description": "Changing viewing habits"
            },
            {
              "title": "French YouTuber Everest Documentary",
              "url": "https://www.france24.com/en/live-news/20240916-french-youtuber-hits-peak-with-everest-documentary",
              "description": "Content platform translation"
            },
            {
              "title": "AI Education Market Opportunity",
              "url": "https://www.instagram.com/reel/DTLiq85EhfH/?igsh=eGNvODUxMXBxYTFl",
              "description": "Growing education sector"
            },
            {
              "title": "Interesting AI Reading",
              "url": "https://x.com/shanaka86/status/2006980687069589841?s=46&t=ny3cTkRu7TUZVu8olxOKQQ",
              "description": "Industry analysis"
            },
            {
              "title": "DemonFlyingFox Threads Post",
              "url": "https://www.threads.com/@jaiford99/post/DTHImrhDEhQ?xmt=AQF0IviTrQylg_wWlEQup5qJ_E2nVKV9vvHfMTP45n-JhiIfKXvpqsKl4Mp3xoVycZYGX5Ho&source_surface=35&slof=1",
              "description": "Viral AI content"
            }
          ]
        }
      ]
    }
  ]
}